trex.org
#+TITLE: Data stored in TREXIO
#+STARTUP: latexpreview
#+SETUPFILE: docs/theme.setup

  For simplicity, the singular form is always used for the names of
  groups and attributes, and all data are stored in atomic units.
  The dimensions of the arrays in the tables below are given in
  column-major order (as in Fortran), and the ordering of the dimensions
  is reversed in the produced ~trex.json~ configuration file as the
  library is written in C.

   #+begin_src python :tangle trex.json :exports none
{
   #+end_src

   #+RESULTS:

   Dimensions are given both in row-major ~[]~ and column-major ~()~
   formats. Pick the one adapted to the programming language in which
   you use TREXIO (Numpy is by default row-major, and Fortran is column-major).
   In the column-major representation, ~A(i,j)~ and ~A(i+1,j)~ are
   contiguous in memory. In the row-major representation, ~A[i,j]~ and
   ~A[i,j+1]~ are contiguous.

* Metadata (metadata group)

  As we expect TREXIO files to be archived in open-data repositories,
  we give the possibility to the users to store some metadata inside
  the files. We propose to store the list of names of the codes which
  have participated to the creation of the file, a list of authors of
  the file, and a textual description.

  #+NAME: metadata
  | Variable          | Type  | Row-major Dimensions    | Column-major Dimensions | Description                              |
  |-------------------+-------+-------------------------+-------------------------+------------------------------------------|
  | ~code_num~        | ~dim~ |                         |                         | Number of codes used to produce the file |
  | ~code~            | ~str~ | ~[metadata.code_num]~   | ~(metadata.code_num)~   | Names of the codes used                  |
  | ~author_num~      | ~dim~ |                         |                         | Number of authors of the file            |
  | ~author~          | ~str~ | ~[metadata.author_num]~ | ~(metadata.author_num)~ | Names of the authors of the file         |
  | ~package_version~ | ~str~ |                         |                         | TREXIO version used to produce the file  |
  | ~description~     | ~str~ |                         |                         | Text describing the content of file      |
  | ~unsafe~          | ~int~ |                         |                         | ~1~: true, ~0~: false                    |

  **Note:** The ~unsafe~ attribute of the ~metadata~ group indicates
  whether the file has been previously opened with ~'u'~ mode.  It is
  automatically written in the file upon the first unsafe opening.  If
  the user has checked that the TREXIO file is valid (e.g. using
  ~trexio-tools~) after unsafe operations, then the ~unsafe~ attribute
  value can be manually overwritten (in unsafe mode) from ~1~ to ~0~.

  #+CALL: json(data=metadata, title="metadata")

  #+RESULTS:
  :results:
  #+begin_src python :tangle trex.json
      "metadata": {
		 "code_num" : [ "dim", []                        ]
	,            "code" : [ "str", [ "metadata.code_num" ]   ]
	,      "author_num" : [ "dim", []                        ]
	,          "author" : [ "str", [ "metadata.author_num" ] ]
	, "package_version" : [ "str", []                        ]
	,     "description" : [ "str", []                        ]
	,          "unsafe" : [ "int", []                        ]
      } ,
  #+end_src

  #+RESULTS:

  :end:

* System
** Nucleus (nucleus group)

   The nuclei are considered as fixed point charges. Coordinates are
   given in Cartesian $(x,y,z)$ format.

   #+NAME: nucleus
  | Variable      | Type    | Row-major Dimensions | Column-major Dimensions | Description              |
  |---------------+---------+----------------------+-------------------------+--------------------------|
  | ~num~         | ~dim~   |                      |                         | Number of nuclei         |
  | ~charge~      | ~float~ | ~[nucleus.num]~      | ~(nucleus.num)~         | Charges of the nuclei    |
  | ~coord~       | ~float~ | ~[nucleus.num, 3]~   | ~(3, nucleus.num)~      | Coordinates of the atoms |
  | ~label~       | ~str~   | ~[nucleus.num]~      | ~(nucleus.num)~         | Atom labels              |
  | ~point_group~ | ~str~   |                      |                         | Symmetry point group     |
  | ~repulsion~   | ~float~ |                      |                         | Nuclear repulsion energy |

   #+CALL: json(data=nucleus, title="nucleus")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "nucleus": {
		   "num" : [ "dim"  , []                     ]
	 ,      "charge" : [ "float", [ "nucleus.num" ]      ]
	 ,       "coord" : [ "float", [ "nucleus.num", "3" ] ]
	 ,       "label" : [ "str"  , [ "nucleus.num" ]      ]
	 , "point_group" : [ "str"  , []                     ]
	 ,   "repulsion" : [ "float", []                     ]
       } ,
   #+end_src

   #+RESULTS:

   :end:

