trex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-02 Sat 10:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data stored in TREXIO</title>
<meta name="author" content="TREX-CoE" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" title="Standard" href="trexio.css" type="text/css" />



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Data stored in TREXIO</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org28522f1">1. Metadata (metadata group)</a></li>
<li><a href="#orgb048fcf">2. System</a>
<ul>
<li><a href="#orgfabd15c">2.1. Nucleus (nucleus group)</a></li>
<li><a href="#org7b98dd6">2.2. Cell (cell group)</a></li>
<li><a href="#org453d596">2.3. Periodic boundary calculations (pbc group)</a></li>
<li><a href="#org9087c62">2.4. Electron (electron group)</a></li>
<li><a href="#org59b1af5">2.5. Ground or excited states (state group)</a></li>
</ul>
</li>
<li><a href="#orgf76cbcc">3. Basis functions</a>
<ul>
<li><a href="#orgfc4ca95">3.1. Basis set (basis group)</a>
<ul>
<li><a href="#org75d1950">3.1.1. Gaussian- and Slater-type orbitals</a></li>
<li><a href="#orgdd10ca2">3.1.2. Numerical orbitals</a></li>
<li><a href="#orgb270bcc">3.1.3. Plane waves</a></li>
<li><a href="#orgd55cf47">3.1.4. Oscillating orbitals</a></li>
<li><a href="#org845dc0c">3.1.5. Data definitions</a></li>
<li><a href="#orga4fe5ca">3.1.6. Example</a></li>
</ul>
</li>
<li><a href="#org13d5744">3.2. Effective core potentials (ecp group)</a>
<ul>
<li><a href="#orged8963d">3.2.1. Example</a></li>
</ul>
</li>
<li><a href="#org9972ad9">3.3. Numerical integration grid (grid group)</a></li>
</ul>
</li>
<li><a href="#org689b05c">4. Orbitals</a>
<ul>
<li><a href="#org077b12d">4.1. Atomic orbitals (ao group)</a>
<ul>
<li><a href="#ao_one_e">4.1.1. One-electron integrals (<code>ao_1e_int</code> group)</a></li>
<li><a href="#ao_two_e">4.1.2. Two-electron integrals (<code>ao_2e_int</code> group)</a></li>
</ul>
</li>
<li><a href="#org605564e">4.2. Molecular orbitals (mo group)</a>
<ul>
<li><a href="#org52a6dd2">4.2.1. One-electron integrals (<code>mo_1e_int</code> group)</a></li>
<li><a href="#org93aee0f">4.2.2. Two-electron integrals (<code>mo_2e_int</code> group)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org21a9df2">5. Multi-determinant information</a>
<ul>
<li><a href="#orgab0a4bd">5.1. Slater determinants (determinant group)</a></li>
<li><a href="#orgaed4105">5.2. Configuration state functions (csf group)</a></li>
<li><a href="#orgbf377ef">5.3. Amplitudes (amplitude group)</a></li>
<li><a href="#org089ccdc">5.4. Reduced density matrices (rdm group)</a></li>
</ul>
</li>
<li><a href="#org86f211e">6. Correlation factors</a>
<ul>
<li><a href="#org46f3db4">6.1. Jastrow factor (jastrow group)</a>
<ul>
<li><a href="#org328a185">6.1.1. CHAMP</a></li>
<li><a href="#org8a5ced6">6.1.2. Mu</a></li>
<li><a href="#orgcddc2dc">6.1.3. Table of values</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org23525d3">7. Quantum Monte Carlo data (qmc group)</a></li>
</ul>
</div>
</div>
<p>
For simplicity, the singular form is always used for the names of
groups and attributes, and all data are stored in atomic units.
The dimensions of the arrays in the tables below are given in
column-major order (as in Fortran), and the ordering of the dimensions
is reversed in the produced <code>trex.json</code> configuration file as the
library is written in C.
</p>

<p>
Dimensions are given both in row-major <code>[]</code> and column-major <code>()</code>
formats. Pick the one adapted to the programming language in which
you use TREXIO (Numpy is by default row-major, and Fortran is column-major).
In the column-major representation, <code>A(i,j)</code> and <code>A(i+1,j)</code> are
contiguous in memory. In the row-major representation, <code>A[i,j]</code> and
<code>A[i,j+1]</code> are contiguous.
</p>

<div id="outline-container-org28522f1" class="outline-2">
<h2 id="org28522f1"><span class="section-number-2">1.</span> Metadata (metadata group)</h2>
<div class="outline-text-2" id="text-1">
<p>
As we expect TREXIO files to be archived in open-data repositories,
we give the possibility to the users to store some metadata inside
the files. We propose to store the list of names of the codes which
have participated to the creation of the file, a list of authors of
the file, and a textual description.
</p>

<table id="org0ecb2dc" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>code_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of codes used to produce the file</td>
</tr>

<tr>
<td class="org-left"><code>code</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left"><code>[metadata.code_num]</code></td>
<td class="org-left"><code>(metadata.code_num)</code></td>
<td class="org-left">Names of the codes used</td>
</tr>

<tr>
<td class="org-left"><code>author_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of authors of the file</td>
</tr>

<tr>
<td class="org-left"><code>author</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left"><code>[metadata.author_num]</code></td>
<td class="org-left"><code>(metadata.author_num)</code></td>
<td class="org-left">Names of the authors of the file</td>
</tr>

<tr>
<td class="org-left"><code>package_version</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">TREXIO version used to produce the file</td>
</tr>

<tr>
<td class="org-left"><code>description</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Text describing the content of file</td>
</tr>

<tr>
<td class="org-left"><code>unsafe</code></td>
<td class="org-left"><code>int</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>1</code>: true, <code>0</code>: false</td>
</tr>
</tbody>
</table>

<p>
<b><b>Note:</b></b> The <code>unsafe</code> attribute of the <code>metadata</code> group indicates
whether the file has been previously opened with <code>'u'</code> mode.  It is
automatically written in the file upon the first unsafe opening.  If
the user has checked that the TREXIO file is valid (e.g. using
<code>trexio-tools</code>) after unsafe operations, then the <code>unsafe</code> attribute
value can be manually overwritten (in unsafe mode) from <code>1</code> to <code>0</code>.
</p>
</div>
</div>

<div id="outline-container-orgb048fcf" class="outline-2">
<h2 id="orgb048fcf"><span class="section-number-2">2.</span> System</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfabd15c" class="outline-3">
<h3 id="orgfabd15c"><span class="section-number-3">2.1.</span> Nucleus (nucleus group)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The nuclei are considered as fixed point charges. Coordinates are
given in Cartesian \((x,y,z)\) format.
</p>

<table id="orgd330145" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of nuclei</td>
</tr>

<tr>
<td class="org-left"><code>charge</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[nucleus.num]</code></td>
<td class="org-left"><code>(nucleus.num)</code></td>
<td class="org-left">Charges of the nuclei</td>
</tr>

<tr>
<td class="org-left"><code>coord</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[nucleus.num, 3]</code></td>
<td class="org-left"><code>(3, nucleus.num)</code></td>
<td class="org-left">Coordinates of the atoms</td>
</tr>

<tr>
<td class="org-left"><code>label</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left"><code>[nucleus.num]</code></td>
<td class="org-left"><code>(nucleus.num)</code></td>
<td class="org-left">Atom labels</td>
</tr>

<tr>
<td class="org-left"><code>point_group</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Symmetry point group</td>
</tr>

<tr>
<td class="org-left"><code>repulsion</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Nuclear repulsion energy</td>
</tr>
</tbody>
</table>
</div>
</div>
