trex.org
** Cell (cell group)

   3 Lattice vectors to define a box containing the system, for example
   used in periodic calculations.

   #+NAME: cell
  | Variable | Type    | Row-major Dimensions | Column-major Dimensions | Description                                                              |
  |----------+---------+----------------------+-------------------------+--------------------------------------------------------------------------|
  | ~a~      | ~float~ | ~[3]~                | ~(3)~                   | First real space lattice vector                                          |
  | ~b~      | ~float~ | ~[3]~                | ~(3)~                   | Second real space lattice vector                                         |
  | ~c~      | ~float~ | ~[3]~                | ~(3)~                   | Third real space lattice vector                                          |
  | ~g_a~    | ~float~ | ~[3]~                | ~(3)~                   | First reciprocal space lattice vector                                    |
  | ~g_b~    | ~float~ | ~[3]~                | ~(3)~                   | Second reciprocal space lattice vector                                   |
  | ~g_c~    | ~float~ | ~[3]~                | ~(3)~                   | Third reciprocal space lattice vector                                    |
  | ~two_pi~ | ~int~   |                      |                         | ~0~ or ~1~. If ~two_pi=1~, $2\pi$ is included in the reciprocal vectors. |

   #+CALL: json(data=cell, title="cell")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "cell": {
		"a" : [ "float", [ "3" ] ]
	 ,      "b" : [ "float", [ "3" ] ]
	 ,      "c" : [ "float", [ "3" ] ]
	 ,    "g_a" : [ "float", [ "3" ] ]
	 ,    "g_b" : [ "float", [ "3" ] ]
	 ,    "g_c" : [ "float", [ "3" ] ]
	 , "two_pi" : [ "int"  , []      ]
       } ,
   #+end_src

   #+RESULTS:

   :end:

** Periodic boundary calculations (pbc group)


   #+NAME: pbc
  | Variable         | Type    | Row-major Dimensions | Column-major Dimensions | Description                                          |
  |------------------+---------+----------------------+-------------------------+------------------------------------------------------|
  | ~periodic~       | ~int~   |                      |                         | ~1~: true or ~0~: false                              |
  | ~k_point_num~    | ~dim~   |                      |                         | Number of $k$-points                                 |
  | ~k_point~        | ~float~ | ~[3]~                | ~(3)~                   | $k$-point sampling                                   |
  | ~k_point_weight~ | ~float~ | ~[pbc.k_point_num]~  | ~(pbc.k_point_num)~     | $k$-point weight                                     |
  | ~madelung~       | ~float~ |                      |                         | Madelung correction of the Ewald probe charge method |

   #+CALL: json(data=pbc, title="pbc")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "pbc": {
		 "periodic" : [ "int"  , []                    ]
	 ,    "k_point_num" : [ "dim"  , []                    ]
	 ,        "k_point" : [ "float", [ "3" ]               ]
	 , "k_point_weight" : [ "float", [ "pbc.k_point_num" ] ]
	 ,       "madelung" : [ "float", []                    ]
       } ,
   #+end_src

   #+RESULTS:

   :end:

** Electron (electron group)

   The chemical system consists of nuclei and electrons, where the
   nuclei are considered as fixed point charges with Cartesian
   coordinates.  The wave function is stored in the spin-free
   formalism, and therefore, it is necessary for the user to
   explicitly store the number of electrons with spin up
   ($N_\uparrow$) and spin down ($N_\downarrow$).  These numbers
   correspond to the normalization of the spin-up and spin-down
   single-particle reduced density matrices.

   We consider wave functions expressed in the spin-free formalism, where
   the number of \uparrow and \downarrow electrons is fixed.


   #+NAME:electron
  | Variable | Type  | Row-major Dimensions | Column-major Dimensions | Description                         |
  |----------+-------+----------------------+-------------------------+-------------------------------------|
  | ~num~    | ~dim~ |                      |                         | Number of electrons                 |
  | ~up_num~ | ~int~ |                      |                         | Number of \uparrow-spin electrons   |
  | ~dn_num~ | ~int~ |                      |                         | Number of \downarrow-spin electrons |

   #+CALL: json(data=electron, title="electron")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "electron": {
	      "num" : [ "dim", []  ]
	 , "up_num" : [ "int", []  ]
	 , "dn_num" : [ "int", []  ]
       } ,
   #+end_src

   #+RESULTS:

   :end:

