trex.html

<div id="outline-container-org7b98dd6" class="outline-3">
<h3 id="org7b98dd6"><span class="section-number-3">2.2.</span> Cell (cell group)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
3 Lattice vectors to define a box containing the system, for example
used in periodic calculations.
</p>

<table id="orgac1e89d" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>a</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[3]</code></td>
<td class="org-left"><code>(3)</code></td>
<td class="org-left">First real space lattice vector</td>
</tr>

<tr>
<td class="org-left"><code>b</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[3]</code></td>
<td class="org-left"><code>(3)</code></td>
<td class="org-left">Second real space lattice vector</td>
</tr>

<tr>
<td class="org-left"><code>c</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[3]</code></td>
<td class="org-left"><code>(3)</code></td>
<td class="org-left">Third real space lattice vector</td>
</tr>

<tr>
<td class="org-left"><code>g_a</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[3]</code></td>
<td class="org-left"><code>(3)</code></td>
<td class="org-left">First reciprocal space lattice vector</td>
</tr>

<tr>
<td class="org-left"><code>g_b</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[3]</code></td>
<td class="org-left"><code>(3)</code></td>
<td class="org-left">Second reciprocal space lattice vector</td>
</tr>

<tr>
<td class="org-left"><code>g_c</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[3]</code></td>
<td class="org-left"><code>(3)</code></td>
<td class="org-left">Third reciprocal space lattice vector</td>
</tr>

<tr>
<td class="org-left"><code>two_pi</code></td>
<td class="org-left"><code>int</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>0</code> or <code>1</code>. If <code>two_pi=1</code>, \(2\pi\) is included in the reciprocal vectors.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org453d596" class="outline-3">
<h3 id="org453d596"><span class="section-number-3">2.3.</span> Periodic boundary calculations (pbc group)</h3>
<div class="outline-text-3" id="text-2-3">
<table id="orgcf8a5f2" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>periodic</code></td>
<td class="org-left"><code>int</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>1</code>: true or <code>0</code>: false</td>
</tr>

<tr>
<td class="org-left"><code>k_point_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of $k$-points</td>
</tr>

<tr>
<td class="org-left"><code>k_point</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[pbc.k_point_num,3]</code></td>
<td class="org-left"><code>(3,pbc.k_point_num)</code></td>
<td class="org-left">$k$-point sampling</td>
</tr>

<tr>
<td class="org-left"><code>k_point_weight</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[pbc.k_point_num]</code></td>
<td class="org-left"><code>(pbc.k_point_num)</code></td>
<td class="org-left">$k$-point weight</td>
</tr>

<tr>
<td class="org-left"><code>madelung</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Madelung correction of the Ewald probe charge method</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9087c62" class="outline-3">
<h3 id="org9087c62"><span class="section-number-3">2.4.</span> Electron (electron group)</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The chemical system consists of nuclei and electrons, where the
nuclei are considered as fixed point charges with Cartesian
coordinates.  The wave function is stored in the spin-free
formalism, and therefore, it is necessary for the user to
explicitly store the number of electrons with spin up
(\(N_\uparrow\)) and spin down (\(N_\downarrow\)).  These numbers
correspond to the normalization of the spin-up and spin-down
single-particle reduced density matrices.
</p>

<p>
We consider wave functions expressed in the spin-free formalism, where
the number of &uarr; and &darr; electrons is fixed.
</p>


<table id="orgff265eb" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of electrons</td>
</tr>

<tr>
<td class="org-left"><code>up_num</code></td>
<td class="org-left"><code>int</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of &uarr;-spin electrons</td>
</tr>

<tr>
<td class="org-left"><code>dn_num</code></td>
<td class="org-left"><code>int</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of &darr;-spin electrons</td>
</tr>
</tbody>
</table>
</div>
</div>
