trex.org
** Ground or excited states (state group)

   This group contains information about excited states. Since only a
   single state can be stored in a TREXIO file, it is possible to store
   in the main TREXIO file the names of auxiliary files containing the
   information of the other states.

   The ~file_name~ and ~label~ arrays have to be written only for the
   main file, e.g. the one containing the ground state wave function
   together with the basis set parameters, molecular orbitals,
   integrals, etc.
   The ~id~ and ~current_label~ attributes need to be specified for each file.

   #+NAME: state
  | Variable        | Type    | Row-major Dimensions | Column-major Dimensions | Description                                                                                 |
  |-----------------+---------+----------------------+-------------------------+---------------------------------------------------------------------------------------------|
  | ~num~           | ~dim~   |                      |                         | Number of states (including the ground state)                                               |
  | ~id~            | ~index~ |                      |                         | Index of the current state (0 is ground state)                                              |
  | ~energy~        | ~float~ |                      |                         | Energy of the current state                                                                 |
  | ~current_label~ | ~str~   |                      |                         | Label of the current state                                                                  |
  | ~label~         | ~str~   | ~[state.num]~        | ~(state.num)~           | Labels of all states                                                                        |
  | ~file_name~     | ~str~   | ~[state.num]~        | ~(state.num)~           | Names of the TREXIO files linked to the current one (i.e. containing data for other states) |

   #+CALL: json(data=state, title="state")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "state": {
		     "num" : [ "dim"  , []              ]
	 ,            "id" : [ "index", []              ]
	 ,        "energy" : [ "float", []              ]
	 , "current_label" : [ "str"  , []              ]
	 ,         "label" : [ "str"  , [ "state.num" ] ]
	 ,     "file_name" : [ "str"  , [ "state.num" ] ]
       } ,
   #+end_src

   #+RESULTS:

   :end:

* Basis functions
** Basis set (basis group)

  Different computational chemistry codes apply normalization at
  various levels. The normalization of basis functions requires the
  evaluation of overlap integrals, which might not always be
  supported by the client software. For this reason, normalization
  constants should be explicitly provided in the TREXIO files to
  ensure portability and completeness.

*** Gaussian- and Slater-type orbitals

    We consider here basis functions centered on nuclei. It is
    therefore possible to introduce *dummy atoms* (artificial centers
    with no physical meaning) solely for the purpose of placing basis
    functions at arbitrary locations in space.

    The atomic basis set is defined as a list of shells. Each shell
    $s$ is centered on a point $\mathbf{R}_A$, associated with a given
    angular momentum $\ell_s$, and characterized by a radial function
    $R_s(\mathbf{r})$. Note that since the angular functions are
    defined as regular solid harmonics that include the $r^{\ell_s}$ factor,
    the radial functions in TREXIO differ from the textbook definition
    by a factor of $r^{-\ell_s}$.

    The radial function is a linear combination of
    $N_{\text{prim}}$ *primitive* functions. These primitives may be
    of Slater-type or Gaussian-type, and are parameterized by
    exponents $\gamma_{ks}$ and contraction coefficients $a_{ks}$.

    Slater orbitals are written as:

    \[
    R_s^{\text{STO}}(\mathbf{r}) = \mathcal{N}_s  \left| \mathbf{r} - \mathbf{R}_A \right|^{n_s-1-\ell_s}
\sum_{k=1}^{N_{\text{prim}}}
f_{ks}\,a_{ks}\,
\exp\left( -\zeta_{ks} \left| \mathbf{r} - \mathbf{R}_A \right| \right)
    \]

    Gaussian-type orbitals (GTOs) are usually defined as:

    \[
    R_s^{\text{GTO}}(\mathbf{r}) = \mathcal{N}_s
    \sum_{k=1}^{N_{\text{prim}}} f_{ks} \, a_{ks}\,
    \exp\left( -\gamma_{ks} \left| \mathbf{r} - \mathbf{R}_A \right|^2 \right)
    \]

    GTO-based codes usually use *spherically pure* Gaussians, in which
    case the radial prefactor exponent is zero, as the
    $r^{\ell_s}$ factor is already included in the solid harmonics.

    Standard basis sets assume that the primitive functions are
    normalized. In that case, a normalization constant $f_{ks}$ must
    be computed and applied to each primitive. This normalization
    constant usually depends on the exponent and on the quantum
    numbers $n$ and $\ell$. If this normalization is not required,
    then $f_{ks} = 1$.

    Similarly, some codes expect the contracted basis functions
    $R_s(\mathbf{r})$ to be normalized. In this case, an additional
    normalization factor $\mathcal{N}_s$ must be computed. If the
    full basis function is not normalized, then $\mathcal{N}_s = 1$.

