trex.html

<div id="outline-container-org59b1af5" class="outline-3">
<h3 id="org59b1af5"><span class="section-number-3">2.5.</span> Ground or excited states (state group)</h3>
<div class="outline-text-3" id="text-2-5">
<p>
This group contains information about excited states. Since only a
single state can be stored in a TREXIO file, it is possible to store
in the main TREXIO file the names of auxiliary files containing the
information of the other states.
</p>

<p>
The <code>file_name</code> and <code>label</code> arrays have to be written only for the
main file, e.g. the one containing the ground state wave function
together with the basis set parameters, molecular orbitals,
integrals, etc.
The <code>id</code> and <code>current_label</code> attributes need to be specified for each file.
</p>

<table id="org2429682" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of states (including the ground state)</td>
</tr>

<tr>
<td class="org-left"><code>id</code></td>
<td class="org-left"><code>index</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Index of the current state (0 is ground state)</td>
</tr>

<tr>
<td class="org-left"><code>energy</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Energy of the current state</td>
</tr>

<tr>
<td class="org-left"><code>current_label</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Label of the current state</td>
</tr>

<tr>
<td class="org-left"><code>label</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left"><code>[state.num]</code></td>
<td class="org-left"><code>(state.num)</code></td>
<td class="org-left">Labels of all states</td>
</tr>

<tr>
<td class="org-left"><code>file_name</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left"><code>[state.num]</code></td>
<td class="org-left"><code>(state.num)</code></td>
<td class="org-left">Names of the TREXIO files linked to the current one (i.e. containing data for other states)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgf76cbcc" class="outline-2">
<h2 id="orgf76cbcc"><span class="section-number-2">3.</span> Basis functions</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgfc4ca95" class="outline-3">
<h3 id="orgfc4ca95"><span class="section-number-3">3.1.</span> Basis set (basis group)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Different computational chemistry codes apply normalization at
various levels. The normalization of basis functions requires the
evaluation of overlap integrals, which might not always be
supported by the client software. For this reason, normalization
constants should be explicitly provided in the TREXIO files to
ensure portability and completeness.
</p>
</div>

<div id="outline-container-org75d1950" class="outline-4">
<h4 id="org75d1950"><span class="section-number-4">3.1.1.</span> Gaussian- and Slater-type orbitals</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
We consider here basis functions centered on nuclei. It is
therefore possible to introduce <b>dummy atoms</b> (artificial centers
with no physical meaning) solely for the purpose of placing basis
functions at arbitrary locations in space.
</p>

<p>
The atomic basis set is defined as a list of shells. Each shell
\(s\) is centered on a point \(\mathbf{R}_A\), associated with a given
angular momentum \(\ell_s\), and characterized by a radial function
\(R_s(\mathbf{r})\). Note that since the angular functions are
defined as regular solid harmonics that include the \(r^{\ell_s}\) factor,
the radial functions in TREXIO differ from the textbook definition
by a factor of \(r^{-\ell_s}\).
</p>

<p>
The radial function is a linear combination of
\(N_{\text{prim}}\) <b>primitive</b> functions. These primitives may be
of Slater-type or Gaussian-type, and are parameterized by
exponents \(\gamma_{ks}\) and contraction coefficients \(a_{ks}\).
</p>

<p>
Slater orbitals are written as:
</p>

<p>
\[
    R_s^{\text{STO}}(\mathbf{r}) = \mathcal{N}_s  \left| \mathbf{r} - \mathbf{R}_A \right|^{n_s-1-\ell_s}
\sum_{k=1}^{N_{\text{prim}}}
f_{ks}\,a_{ks}\,
\exp\left( -\zeta_{ks} \left| \mathbf{r} - \mathbf{R}_A \right| \right)
    \]
</p>

<p>
Gaussian-type orbitals (GTOs) are usually defined as:
</p>

<p>
\[
    R_s^{\text{GTO}}(\mathbf{r}) = \mathcal{N}_s
    \sum_{k=1}^{N_{\text{prim}}} f_{ks} \, a_{ks}\,
    \exp\left( -\gamma_{ks} \left| \mathbf{r} - \mathbf{R}_A \right|^2 \right)
    \]
</p>

<p>
GTO-based codes usually use <b>spherically pure</b> Gaussians, in which
case the radial prefactor exponent is zero, as the
\(r^{\ell_s}\) factor is already included in the solid harmonics.
</p>

<p>
Standard basis sets assume that the primitive functions are
normalized. In that case, a normalization constant \(f_{ks}\) must
be computed and applied to each primitive. This normalization
constant usually depends on the exponent and on the quantum
numbers \(n\) and \(\ell\). If this normalization is not required,
then \(f_{ks} = 1\).
</p>

<p>
Similarly, some codes expect the contracted basis functions
\(R_s(\mathbf{r})\) to be normalized. In this case, an additional
normalization factor \(\mathcal{N}_s\) must be computed. If the
full basis function is not normalized, then \(\mathcal{N}_s = 1\).
</p>
</div>
</div>
