trex.org
*** Numerical orbitals

    TREXIO supports numerical atom centered orbitals. The implementation is
    based on the approach of FHI-aims [Blum, V. et al; Ab initio molecular
    simulations with numeric atom-centered orbitals; Computer Physics
    Communications 2009]. These orbitals are
    defined by the atom they are centered on, their angular momentum and a
    radial function $R_s$, which is of the form
    \[
    R_s(\mathbf{r}) = \mathcal{N}_s \frac{u_i(\mathbf{r})}{r^{-n_s}}.
    \]
    Where $u_i(\mathbf{r})$ is numerically tabulated on a dense logarithmic
    grid. It is constructed to vanish for any $\mathbf{r}$
    outside of the grid. The reference points are stored in ~nao_grid_r~
    and ~nao_grid_phi~. Additionaly, a separate spline for the first and second
    derivative of $u(\mathbf{r})$ can be stored in ~nao_grid_grad~ and ~nao_grid_lap~.
    Storing them in this form allows to calculate the actual first and
    second derivatives easily as follows:

    \[
      \frac{\partial \phi}{\partial x} = \frac{x}{r^2}\left( u^\prime\left(r\right) - \frac{u\left(r\right)}{r}\right)
    \]
    \[
      \frac{\partial^2 \phi}{\partial x^2} = \frac{1}{r^3}\left(x^2 u^{\prime\prime}(r) + \left( 3x^2-r^2\right) \left( \frac{u(r)}{r^2} - \frac{u'(r)}{r}\right) \right)
    \]

    The index of the first data point for each shell is stored in
    ~nao_grid_start~, the number of data points per spline is stored
    in ~nao_grid_size~ for convenience.

    What kind of spline is used can be provided in the ~interpolator_kind~ field.
    For example, FHI-aims uses a cubic spline, so the ~interpolator_kind~ is
    \"Polynomial\" and the ~interp_coeff_cnt~ is $4$. In this case, the first
    interpolation coefficient per data point is the absolute term, the second is for
    the linear term etc.
    The interpolation coefficients for the wave function are given in the
     ~interpolator_phi~ array. The ~interpolator_grad~ and ~interpolator_lap~
    arrays provide a spline for the gradient and Laplacian, respectively.
    The argument passed to the interpolants is on the logarithmic scale of
    the reference points: If the argument is an integer $i$, the interpolant
    will return the value of $u(\mathbf{r})$ at the $i$th reference point.
    A radius is converted to this scale by (note the zero-indexing)
    \[
    i_{\log} = \frac{1}{c} \cdot \log \left( \frac{r}{r_0} \right)
    \]
    where
    \[
    c = \log\left(\frac{r_1}{r_0}\right)
    \]
    For convenience, this conversion and functions to evaluate the splines
    are provided with trexio. Since these implementations are not adapted to
    a specific software architecture, a programm using these orbitals should
    reimplement them with consideration for its specific needs.

*** Plane waves

    A plane wave is defined as

    \[
       \chi_j(\mathbf{r}) = \exp \left( -i \mathbf{G}_j \cdot \mathbf{r} \right)
    \]

    The basis set is defined as the array of $k$-points in the
    reciprocal space $\mathbf{G}_j$, defined in the ~pbc~ group. The
    kinetic energy cutoff ~e_cut~ is the only input data relevant to
    plane waves.

*** Oscillating orbitals

    Basis functions can be made oscillating as
    \[
    R_s(\mathbf{r}) = \mathcal{N}_s \vert\mathbf{r}-\mathbf{R}_A\vert^{n_s}
    \sum_{k=1}^{N_{\text{prim}}} a_{ks}\, f_{ks}(\gamma_{ks},p)\,
    \exp \left( - \gamma_{ks}
    \vert \mathbf{r}-\mathbf{R}_A \vert ^p \right)\, \cos \left( \beta_{ks} \vert \mathbf{r}-\mathbf{R}_A \vert ^q \right)
    \]

    Oscillation kind can be:
    - ~Cos1~ for $q=1$
    - ~Cos2~ for $q=2$

