trex.org
*** Data definitions

    #+NAME: basis
  | Variable            | Type    | Row-major Dimensions                           | Column-major Dimensions                        | Description                                                                  |
  |---------------------+---------+------------------------------------------------+------------------------------------------------+------------------------------------------------------------------------------|
  | ~type~              | ~str~   |                                                |                                                | Type of basis set: "Gaussian", "Slater", "Numerical" or "PW" for plane waves |
  | ~prim_num~          | ~dim~   |                                                |                                                | Total number of primitives                                                   |
  | ~shell_num~         | ~dim~   |                                                |                                                | Total number of shells                                                       |
  | ~nao_grid_num~      | ~dim~   |                                                |                                                | Total number of grid points for numerical orbitals                           |
  | ~interp_coeff_cnt~  | ~dim~   |                                                |                                                | Number of coefficients for the numerical orbital interpolator                |
  | ~nucleus_index~     | ~index~ | ~[basis.shell_num]~                            | ~(basis.shell_num)~                            | One-to-one correspondence between shells and atomic indices                  |
  | ~shell_ang_mom~     | ~int~   | ~[basis.shell_num]~                            | ~(basis.shell_num)~                            | One-to-one correspondence between shells and angular momenta                 |
  | ~shell_factor~      | ~float~ | ~[basis.shell_num]~                            | ~(basis.shell_num)~                            | Normalization factor of each shell ($\mathcal{N}_s$)                         |
  | ~r_power~           | ~int~   | ~[basis.shell_num]~                            | ~(basis.shell_num)~                            | Power to which $r$ is raised ($n_s$)                                         |
  | ~nao_grid_start~    | ~index~ | ~[basis.shell_num]~                            | ~(basis.shell_num)~                            | Index of the first data point for a given numerical orbital                  |
  | ~nao_grid_size~     | ~dim~   | ~[basis.shell_num]~                            | ~(basis.shell_num)~                            | Number of data points per numerical orbital                                  |
  | ~shell_index~       | ~index~ | ~[basis.prim_num]~                             | ~(basis.prim_num)~                             | One-to-one correspondence between primitives and shell index                 |
  | ~exponent~          | ~float~ | ~[basis.prim_num]~                             | ~(basis.prim_num)~                             | Exponents of the primitives ($\gamma_{ks}$)                                  |
  | ~exponent_im~       | ~float~ | ~[basis.prim_num]~                             | ~(basis.prim_num)~                             | Imaginary part of the exponents of the primitives ($\gamma_{ks}$)            |
  | ~coefficient~       | ~float~ | ~[basis.prim_num]~                             | ~(basis.prim_num)~                             | Coefficients of the primitives ($a_{ks}$)                                    |
  | ~coefficient_im~    | ~float~ | ~[basis.prim_num]~                             | ~(basis.prim_num)~                             | Imaginary part of the coefficients of the primitives ($a_{ks}$)              |
  | ~oscillation_arg~   | ~float~ | ~[basis.prim_num]~                             | ~(basis.prim_num)~                             | Additional argument to have oscillating orbitals ($\beta_{ks}$)              |
  | ~oscillation_kind~  | ~str~   |                                                |                                                | Kind of Oscillating function:"Cos1" or "Cos2"                                |
  | ~prim_factor~       | ~float~ | ~[basis.prim_num]~                             | ~(basis.prim_num)~                             | Normalization coefficients for the primitives ($f_{ks}$)                     |
  | ~e_cut~             | ~float~ |                                                |                                                | Energy cut-off for plane-wave calculations                                   |
  | ~nao_grid_radius~   | ~float~ | ~[basis.nao_grid_num]~                         | ~(basis.nao_grid_num)~                         | Radii of grid points for numerical orbitals                                  |
  | ~nao_grid_phi~      | ~float~ | ~[basis.nao_grid_num]~                         | ~(basis.nao_grid_num)~                         | Wave function values for numerical orbitals                                  |
  | ~nao_grid_grad~     | ~float~ | ~[basis.nao_grid_num]~                         | ~(basis.nao_grid_num)~                         | Radial gradient of numerical orbitals                                        |
  | ~nao_grid_lap~      | ~float~ | ~[basis.nao_grid_num]~                         | ~(basis.nao_grid_num)~                         | Laplacian of numerical orbitals                                              |
  | ~interpolator_kind~ | ~str~   |                                                |                                                | Kind of spline, e.g. "Polynomial"                                            |
  | ~interpolator_phi~  | ~float~ | ~[basis.nao_grid_num, basis.interp_coeff_cnt]~ | ~(basis.interp_coeff_cnt, basis.nao_grid_num)~ | Coefficients for numerical orbital interpolation function                    |
  | ~interpolator_grad~ | ~float~ | ~[basis.nao_grid_num, basis.interp_coeff_cnt]~ | ~(basis.interp_coeff_cnt, basis.nao_grid_num)~ | Coefficients for numerical orbital gradient interpolation function           |
  | ~interpolator_lap~  | ~float~ | ~[basis.nao_grid_num, basis.interp_coeff_cnt]~ | ~(basis.interp_coeff_cnt, basis.nao_grid_num)~ | Coefficients for numerical orbital laplacian interpolation function          |



    #+CALL: json(data=basis, title="basis")

    #+RESULTS:
    :results:
    #+begin_src python :tangle trex.json
	"basis": {
			 "type" : [ "str"  , []                                                 ]
	  ,          "prim_num" : [ "dim"  , []                                                 ]
	  ,         "shell_num" : [ "dim"  , []                                                 ]
	  ,      "nao_grid_num" : [ "dim"  , []                                                 ]
	  ,  "interp_coeff_cnt" : [ "dim"  , []                                                 ]
	  ,     "nucleus_index" : [ "index", [ "basis.shell_num" ]                              ]
	  ,     "shell_ang_mom" : [ "int"  , [ "basis.shell_num" ]                              ]
	  ,      "shell_factor" : [ "float", [ "basis.shell_num" ]                              ]
	  ,           "r_power" : [ "int"  , [ "basis.shell_num" ]                              ]
	  ,    "nao_grid_start" : [ "index", [ "basis.shell_num" ]                              ]
	  ,     "nao_grid_size" : [ "dim"  , [ "basis.shell_num" ]                              ]
	  ,       "shell_index" : [ "index", [ "basis.prim_num" ]                               ]
	  ,          "exponent" : [ "float", [ "basis.prim_num" ]                               ]
	  ,       "exponent_im" : [ "float", [ "basis.prim_num" ]                               ]
	  ,       "coefficient" : [ "float", [ "basis.prim_num" ]                               ]
	  ,    "coefficient_im" : [ "float", [ "basis.prim_num" ]                               ]
	  ,   "oscillation_arg" : [ "float", [ "basis.prim_num" ]                               ]
	  ,  "oscillation_kind" : [ "str"  , []                                                 ]
	  ,       "prim_factor" : [ "float", [ "basis.prim_num" ]                               ]
	  ,             "e_cut" : [ "float", []                                                 ]
	  ,   "nao_grid_radius" : [ "float", [ "basis.nao_grid_num" ]                           ]
	  ,      "nao_grid_phi" : [ "float", [ "basis.nao_grid_num" ]                           ]
	  ,     "nao_grid_grad" : [ "float", [ "basis.nao_grid_num" ]                           ]
	  ,      "nao_grid_lap" : [ "float", [ "basis.nao_grid_num" ]                           ]
	  , "interpolator_kind" : [ "str"  , []                                                 ]
	  ,  "interpolator_phi" : [ "float", [ "basis.nao_grid_num", "basis.interp_coeff_cnt" ] ]
	  , "interpolator_grad" : [ "float", [ "basis.nao_grid_num", "basis.interp_coeff_cnt" ] ]
	  ,  "interpolator_lap" : [ "float", [ "basis.nao_grid_num", "basis.interp_coeff_cnt" ] ]
	} ,
    #+end_src

    #+RESULTS:

    :end:

