trex.html

<div id="outline-container-org845dc0c" class="outline-4">
<h4 id="org845dc0c"><span class="section-number-4">3.1.5.</span> Data definitions</h4>
<div class="outline-text-4" id="text-3-1-5">
<table id="orgb000dae" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>type</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Type of basis set: "Gaussian", "Slater", "Numerical" or "PW" for plane waves</td>
</tr>

<tr>
<td class="org-left"><code>prim_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Total number of primitives</td>
</tr>

<tr>
<td class="org-left"><code>shell_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Total number of shells</td>
</tr>

<tr>
<td class="org-left"><code>nao_grid_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Total number of grid points for numerical orbitals</td>
</tr>

<tr>
<td class="org-left"><code>interp_coeff_cnt</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of coefficients for the numerical orbital interpolator</td>
</tr>

<tr>
<td class="org-left"><code>nucleus_index</code></td>
<td class="org-left"><code>index</code></td>
<td class="org-left"><code>[basis.shell_num]</code></td>
<td class="org-left"><code>(basis.shell_num)</code></td>
<td class="org-left">One-to-one correspondence between shells and atomic indices</td>
</tr>

<tr>
<td class="org-left"><code>shell_ang_mom</code></td>
<td class="org-left"><code>int</code></td>
<td class="org-left"><code>[basis.shell_num]</code></td>
<td class="org-left"><code>(basis.shell_num)</code></td>
<td class="org-left">One-to-one correspondence between shells and angular momenta</td>
</tr>

<tr>
<td class="org-left"><code>shell_factor</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.shell_num]</code></td>
<td class="org-left"><code>(basis.shell_num)</code></td>
<td class="org-left">Normalization factor of each shell (\(\mathcal{N}_s\))</td>
</tr>

<tr>
<td class="org-left"><code>r_power</code></td>
<td class="org-left"><code>int</code></td>
<td class="org-left"><code>[basis.shell_num]</code></td>
<td class="org-left"><code>(basis.shell_num)</code></td>
<td class="org-left">Power to which \(r\) is raised (\(n_s\))</td>
</tr>

<tr>
<td class="org-left"><code>nao_grid_start</code></td>
<td class="org-left"><code>index</code></td>
<td class="org-left"><code>[basis.shell_num]</code></td>
<td class="org-left"><code>(basis.shell_num)</code></td>
<td class="org-left">Index of the first data point for a given numerical orbital</td>
</tr>

<tr>
<td class="org-left"><code>nao_grid_size</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left"><code>[basis.shell_num]</code></td>
<td class="org-left"><code>(basis.shell_num)</code></td>
<td class="org-left">Number of data points per numerical orbital</td>
</tr>

<tr>
<td class="org-left"><code>shell_index</code></td>
<td class="org-left"><code>index</code></td>
<td class="org-left"><code>[basis.prim_num]</code></td>
<td class="org-left"><code>(basis.prim_num)</code></td>
<td class="org-left">One-to-one correspondence between primitives and shell index</td>
</tr>

<tr>
<td class="org-left"><code>exponent</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.prim_num]</code></td>
<td class="org-left"><code>(basis.prim_num)</code></td>
<td class="org-left">Exponents of the primitives (\(\gamma_{ks}\))</td>
</tr>

<tr>
<td class="org-left"><code>exponent_im</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.prim_num]</code></td>
<td class="org-left"><code>(basis.prim_num)</code></td>
<td class="org-left">Imaginary part of the exponents of the primitives (\(\gamma_{ks}\))</td>
</tr>

<tr>
<td class="org-left"><code>coefficient</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.prim_num]</code></td>
<td class="org-left"><code>(basis.prim_num)</code></td>
<td class="org-left">Coefficients of the primitives (\(a_{ks}\))</td>
</tr>

<tr>
<td class="org-left"><code>coefficient_im</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.prim_num]</code></td>
<td class="org-left"><code>(basis.prim_num)</code></td>
<td class="org-left">Imaginary part of the coefficients of the primitives (\(a_{ks}\))</td>
</tr>

<tr>
<td class="org-left"><code>oscillation_arg</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.prim_num]</code></td>
<td class="org-left"><code>(basis.prim_num)</code></td>
<td class="org-left">Additional argument to have oscillating orbitals (\(\beta_{ks}\))</td>
</tr>

<tr>
<td class="org-left"><code>oscillation_kind</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Kind of Oscillating function:"Cos1" or "Cos2"</td>
</tr>

<tr>
<td class="org-left"><code>prim_factor</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.prim_num]</code></td>
<td class="org-left"><code>(basis.prim_num)</code></td>
<td class="org-left">Normalization coefficients for the primitives (\(f_{ks}\))</td>
</tr>

<tr>
<td class="org-left"><code>e_cut</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Energy cut-off for plane-wave calculations</td>
</tr>

<tr>
<td class="org-left"><code>nao_grid_radius</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.nao_grid_num]</code></td>
<td class="org-left"><code>(basis.nao_grid_num)</code></td>
<td class="org-left">Radii of grid points for numerical orbitals</td>
</tr>

<tr>
<td class="org-left"><code>nao_grid_phi</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.nao_grid_num]</code></td>
<td class="org-left"><code>(basis.nao_grid_num)</code></td>
<td class="org-left">Wave function values for numerical orbitals</td>
</tr>

<tr>
<td class="org-left"><code>nao_grid_grad</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.nao_grid_num]</code></td>
<td class="org-left"><code>(basis.nao_grid_num)</code></td>
<td class="org-left">Radial gradient of numerical orbitals</td>
</tr>

<tr>
<td class="org-left"><code>nao_grid_lap</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.nao_grid_num]</code></td>
<td class="org-left"><code>(basis.nao_grid_num)</code></td>
<td class="org-left">Laplacian of numerical orbitals</td>
</tr>

<tr>
<td class="org-left"><code>interpolator_kind</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Kind of spline, e.g. "Polynomial"</td>
</tr>

<tr>
<td class="org-left"><code>interpolator_phi</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.nao_grid_num, basis.interp_coeff_cnt]</code></td>
<td class="org-left"><code>(basis.interp_coeff_cnt, basis.nao_grid_num)</code></td>
<td class="org-left">Coefficients for numerical orbital interpolation function</td>
</tr>

<tr>
<td class="org-left"><code>interpolator_grad</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.nao_grid_num, basis.interp_coeff_cnt]</code></td>
<td class="org-left"><code>(basis.interp_coeff_cnt, basis.nao_grid_num)</code></td>
<td class="org-left">Coefficients for numerical orbital gradient interpolation function</td>
</tr>

<tr>
<td class="org-left"><code>interpolator_lap</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[basis.nao_grid_num, basis.interp_coeff_cnt]</code></td>
<td class="org-left"><code>(basis.interp_coeff_cnt, basis.nao_grid_num)</code></td>
<td class="org-left">Coefficients for numerical orbital laplacian interpolation function</td>
</tr>
</tbody>
</table>
</div>
</div>
