trex.org
*** Example

   For example, consider H_2 with the following basis set (in GAMESS
   format), where both the AOs and primitives are considered normalized:

    #+BEGIN_EXAMPLE
HYDROGEN
S   5
1         3.387000E+01           6.068000E-03
2         5.095000E+00           4.530800E-02
3         1.159000E+00           2.028220E-01
4         3.258000E-01           5.039030E-01
5         1.027000E-01           3.834210E-01
S   1
1         3.258000E-01           1.000000E+00
S   1
1         1.027000E-01           1.000000E+00
P   1
1         1.407000E+00           1.000000E+00
P   1
1         3.880000E-01           1.000000E+00
D   1
1         1.057000E+00           1.000000E+00
    #+END_EXAMPLE

    In TREXIO representaion we have:

    #+BEGIN_EXAMPLE
type  = "Gaussian"
prim_num   = 20
shell_num   = 12

# 6 shells per H atom
nucleus_index =
[ 0, 0, 0, 0, 0, 0,
  1, 1, 1, 1, 1, 1 ]

# 3 shells in S (l=0), 2 in P (l=1), 1 in D (l=2)
shell_ang_mom =
[ 0, 0, 0, 1, 1, 2,
  0, 0, 0, 1, 1, 2 ]

# no need to renormalize shells
shell_factor =
[ 1., 1., 1., 1., 1., 1.,
  1., 1., 1., 1., 1., 1. ]

# 5 primitives for the first S shell and then 1 primitive per remaining shells in each H atom
shell_index =
[ 0, 0, 0, 0, 0, 1, 2, 3, 4, 5,
  6, 6, 6, 6, 6, 7, 8, 9, 10, 11 ]

# parameters of the primitives (10 per H atom)
exponent =
[ 33.87, 5.095, 1.159, 0.3258, 0.1027, 0.3258, 0.1027, 1.407, 0.388, 1.057,
  33.87, 5.095, 1.159, 0.3258, 0.1027, 0.3258, 0.1027, 1.407, 0.388, 1.057 ]

coefficient =
[ 0.006068, 0.045308, 0.202822, 0.503903, 0.383421, 1.0, 1.0, 1.0, 1.0, 1.0,
  0.006068, 0.045308, 0.202822, 0.503903, 0.383421, 1.0, 1.0, 1.0, 1.0, 1.0 ]

prim_factor =
[ 1.0006253235944540e+01, 2.4169531573445120e+00, 7.9610924849766440e-01
  3.0734305383061117e-01, 1.2929684417481876e-01, 3.0734305383061117e-01,
  1.2929684417481876e-01, 2.1842769845268308e+00, 4.3649547399719840e-01,
  1.8135965626177861e+00, 1.0006253235944540e+01, 2.4169531573445120e+00,
  7.9610924849766440e-01, 3.0734305383061117e-01, 1.2929684417481876e-01,
  3.0734305383061117e-01, 1.2929684417481876e-01, 2.1842769845268308e+00,
  4.3649547399719840e-01, 1.8135965626177861e+00 ]
    #+END_EXAMPLE

** Effective core potentials (ecp group)

   An effective core potential (ECP) $V_A^{\text{ECP}}$ replacing the
   core electrons of atom $A$ can be expressed as
   \[
   V_A^{\text{ECP}} =
   V_{A \ell_{\max}+1} +
   \sum_{\ell=0}^{\ell_{\max}}
   \delta V_{A \ell}\sum_{m=-\ell}^{\ell} | Y_{\ell m} \rangle \langle Y_{\ell m} |
   \]

   The first term in this equation is attributed to the local channel, while
   the remaining terms correspond to non-local channel projections.  $\ell_{\max}$
   refers to the maximum angular momentum in the non-local component of the ECP.
   The functions \(\delta V_{A \ell}\) and \(V_{A \ell_{\max}+1}\) are parameterized as:
   \begin{eqnarray}
      \delta V_{A \ell}(\mathbf{r}) &=&
      \sum_{q=1}^{N_{q \ell}}
      \beta_{A q \ell}\, |\mathbf{r}-\mathbf{R}_{A}|^{n_{A q \ell}}\,
      e^{-\alpha_{A q \ell} |\mathbf{r}-\mathbf{R}_{A}|^2 } \nonumber\\
      V_{A \ell_{\max}+1}(\mathbf{r}) &=& -\frac{Z_\text{eff}}{|\mathbf{r}-\mathbf{R}_{A}|}+\delta V_{A \ell_{\max}+1}(\mathbf{r})
   \end{eqnarray}
   where $Z_\text{eff}$ is the effective nuclear charge of the center.

   See http://dx.doi.org/10.1063/1.4984046 or https://doi.org/10.1063/1.5121006 for more info.

   #+NAME: ecp
  | Variable             | Type    | Row-major Dimensions | Column-major Dimensions | Description                                                                            |
  |----------------------+---------+----------------------+-------------------------+----------------------------------------------------------------------------------------|
  | ~max_ang_mom_plus_1~ | ~int~   | ~[nucleus.num]~      | ~(nucleus.num)~         | $\ell_{\max}+1$, one higher than the max angular momentum in the removed core orbitals |
  | ~z_core~             | ~int~   | ~[nucleus.num]~      | ~(nucleus.num)~         | Number of core electrons to remove per atom                                            |
  | ~num~                | ~dim~   |                      |                         | Total number of ECP functions for all atoms and all values of $\ell$                   |
  | ~ang_mom~            | ~int~   | ~[ecp.num]~          | ~(ecp.num)~             | One-to-one correspondence between ECP items and the angular momentum $\ell$            |
  | ~nucleus_index~      | ~index~ | ~[ecp.num]~          | ~(ecp.num)~             | One-to-one correspondence between ECP items and the atom index                         |
  | ~exponent~           | ~float~ | ~[ecp.num]~          | ~(ecp.num)~             | $\alpha_{A q \ell}$ all ECP exponents                                                  |
  | ~coefficient~        | ~float~ | ~[ecp.num]~          | ~(ecp.num)~             | $\beta_{A q \ell}$ all ECP coefficients                                                |
  | ~power~              | ~int~   | ~[ecp.num]~          | ~(ecp.num)~             | $n_{A q \ell}$ all ECP powers                                                          |

   There might be some confusion in the meaning of the $\ell_{\max}$.
   It can be attributed to the maximum angular momentum occupied in
   the core orbitals, which are removed by the ECP. On the other
   hand, it can be attributed to the maximum angular momentum of the
   ECP that replaces the core electrons.
   *Note*, that the latter $\ell_{\max}$ is always higher by 1 than the former.

   *Note for developers of TREXIO*: avoid having variables with similar prefix
   in their name. The HDF5 back end might cause issues due to the way
   ~find_dataset~ function works.  For example, in the ECP group we
   use ~max_ang_mom~ and not ~ang_mom_max~. The latter causes issues
   when written before the ~ang_mom~ array in the TREXIO file.
   *Update*: in fact, the aforementioned issue has only been observed
   when using HDF5 version 1.10.4 installed via ~apt-get~. Installing
   the same version from the ~conda-forge~ channel and running it in
   an isolated ~conda~ environment works just fine. Thus, it seems to
   be a bug in the ~apt~-provided package.
   If you encounter the aforementioned issue, please report it to our
   [[https://github.com/TREX-CoE/trexio/issues][issue tracker on GitHub]].

   #+CALL: json(data=ecp, title="ecp")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "ecp": {
	   "max_ang_mom_plus_1" : [ "int"  , [ "nucleus.num" ] ]
	 ,             "z_core" : [ "int"  , [ "nucleus.num" ] ]
	 ,                "num" : [ "dim"  , []                ]
	 ,            "ang_mom" : [ "int"  , [ "ecp.num" ]     ]
	 ,      "nucleus_index" : [ "index", [ "ecp.num" ]     ]
	 ,           "exponent" : [ "float", [ "ecp.num" ]     ]
	 ,        "coefficient" : [ "float", [ "ecp.num" ]     ]
	 ,              "power" : [ "int"  , [ "ecp.num" ]     ]
       } ,
   #+end_src

   #+RESULTS:

   :end:

