trex.org
*** Example

   For example, consider H_2 molecule with the following
   [[https://pseudopotentiallibrary.org/recipes/H/ccECP/H.ccECP.gamess][effective core potential]]
   (in GAMESS input format for the H atom):

    #+BEGIN_EXAMPLE
H-ccECP GEN 0 1
3
1.00000000000000    1 21.24359508259891
21.24359508259891   3 21.24359508259891
-10.85192405303825  2 21.77696655044365
1
0.00000000000000    2 1.000000000000000
    #+END_EXAMPLE

    In TREXIO representation this would be:

    #+BEGIN_EXAMPLE
num = 8

# lmax+1 per atom
max_ang_mom_plus_1 = [ 1, 1 ]

# number of core electrons to remove per atom
zcore = [ 0, 0 ]

# first 4 ECP elements correspond to the first H atom ; the remaining 4 elements are for the second H atom
nucleus_index = [
  0, 0, 0, 0,
  1, 1, 1, 1
  ]

# 3 first ECP elements correspond to potential of the P orbital (l=1), then 1 element for the S orbital (l=0) ; similar for the second H atom
ang_mom = [
  1, 1, 1, 0,
  1, 1, 1, 0
  ]

# ECP quantities that can be attributed to atoms and/or angular momenta based on the aforementioned ecp_nucleus and ecp_ang_mom arrays
coefficient = [
  1.00000000000000, 21.24359508259891, -10.85192405303825, 0.00000000000000,
  1.00000000000000, 21.24359508259891, -10.85192405303825, 0.00000000000000
  ]

exponent = [
  21.24359508259891, 21.24359508259891, 21.77696655044365, 1.000000000000000,
  21.24359508259891, 21.24359508259891, 21.77696655044365, 1.000000000000000
  ]

power = [
  -1, 1, 0, 0,
  -1, 1, 0, 0
  ]
    #+END_EXAMPLE

** Numerical integration grid (grid group)

   In some applications, such as DFT calculations, integrals have to
   be computed numerically on a grid.  A common choice for the angular
   grid is the one proposed by Lebedev and Laikov
   [Russian Academy of Sciences Doklady Mathematics, Volume 59, Number 3, 1999, pages 477-481].
   For the radial grids, many approaches have been developed over the years.

   The structure of this group is adapted for the [[https://github.com/dftlibs/numgrid][numgrid]] library.
   Feel free to submit a PR if you find missing options/functionalities.

    #+NAME: grid
  | Variable        | Type    | Row-major Dimensions | Column-major Dimensions | Description                                                             |
  |-----------------+---------+----------------------+-------------------------+-------------------------------------------------------------------------|
  | ~description~   | ~str~   |                      |                         | Details about the used quadratures can go here                          |
  | ~rad_precision~ | ~float~ |                      |                         | Radial precision parameter (not used in some schemes like Krack-Köster) |
  | ~num~           | ~dim~   |                      |                         | Number of grid points                                                   |
  | ~max_ang_num~   | ~int~   |                      |                         | Maximum number of angular grid points (for pruning)                     |
  | ~min_ang_num~   | ~int~   |                      |                         | Minimum number of angular grid points (for pruning)                     |
  | ~coord~         | ~float~ | ~[grid.num]~         | ~(grid.num)~            | Discretized coordinate space                                            |
  | ~weight~        | ~float~ | ~[grid.num]~         | ~(grid.num)~            | Grid weights according to a given partitioning (e.g. Becke)             |
  | ~ang_num~       | ~dim~   |                      |                         | Number of angular integration points (if used)                          |
  | ~ang_coord~     | ~float~ | ~[grid.ang_num]~     | ~(grid.ang_num)~        | Discretized angular space (if used)                                     |
  | ~ang_weight~    | ~float~ | ~[grid.ang_num]~     | ~(grid.ang_num)~        | Angular grid weights (if used)                                          |
  | ~rad_num~       | ~dim~   |                      |                         | Number of radial integration points (if used)                           |
  | ~rad_coord~     | ~float~ | ~[grid.rad_num]~     | ~(grid.rad_num)~        | Discretized radial space (if used)                                      |
  | ~rad_weight~    | ~float~ | ~[grid.rad_num]~     | ~(grid.rad_num)~        | Radial grid weights  (if used)                                          |

    #+CALL: json(data=grid, title="grid")

    #+RESULTS:
    :results:
    #+begin_src python :tangle trex.json
	"grid": {
	      "description" : [ "str"  , []                 ]
	  , "rad_precision" : [ "float", []                 ]
	  ,           "num" : [ "dim"  , []                 ]
	  ,   "max_ang_num" : [ "int"  , []                 ]
	  ,   "min_ang_num" : [ "int"  , []                 ]
	  ,         "coord" : [ "float", [ "grid.num" ]     ]
	  ,        "weight" : [ "float", [ "grid.num" ]     ]
	  ,       "ang_num" : [ "dim"  , []                 ]
	  ,     "ang_coord" : [ "float", [ "grid.ang_num" ] ]
	  ,    "ang_weight" : [ "float", [ "grid.ang_num" ] ]
	  ,       "rad_num" : [ "dim"  , []                 ]
	  ,     "rad_coord" : [ "float", [ "grid.rad_num" ] ]
	  ,    "rad_weight" : [ "float", [ "grid.rad_num" ] ]
	} ,
    #+end_src

    #+RESULTS:

    :end:

* Orbitals
