trex.html

<div id="outline-container-orged8963d" class="outline-4">
<h4 id="orged8963d"><span class="section-number-4">3.2.1.</span> Example</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
For example, consider H<sub>2</sub> molecule with the following
<a href="https://pseudopotentiallibrary.org/recipes/H/ccECP/H.ccECP.gamess">effective core potential</a>
(in GAMESS input format for the H atom):
</p>

<pre class="example" id="org22c6d0a">
H-ccECP GEN 0 1
3
1.00000000000000    1 21.24359508259891
21.24359508259891   3 21.24359508259891
-10.85192405303825  2 21.77696655044365
1
0.00000000000000    2 1.000000000000000
</pre>

<p>
In TREXIO representation this would be:
</p>

<pre class="example" id="orgea897f6">
num = 8

# lmax+1 per atom
max_ang_mom_plus_1 = [ 1, 1 ]

# number of core electrons to remove per atom
zcore = [ 0, 0 ]

# first 4 ECP elements correspond to the first H atom ; the remaining 4 elements are for the second H atom
nucleus_index = [
  0, 0, 0, 0,
  1, 1, 1, 1
  ]

# 3 first ECP elements correspond to potential of the P orbital (l=1), then 1 element for the S orbital (l=0) ; similar for the second H atom
ang_mom = [
  1, 1, 1, 0,
  1, 1, 1, 0
  ]

# ECP quantities that can be attributed to atoms and/or angular momenta based on the aforementioned ecp_nucleus and ecp_ang_mom arrays
coefficient = [
  1.00000000000000, 21.24359508259891, -10.85192405303825, 0.00000000000000,
  1.00000000000000, 21.24359508259891, -10.85192405303825, 0.00000000000000
  ]

exponent = [
  21.24359508259891, 21.24359508259891, 21.77696655044365, 1.000000000000000,
  21.24359508259891, 21.24359508259891, 21.77696655044365, 1.000000000000000
  ]

power = [
  -1, 1, 0, 0,
  -1, 1, 0, 0
  ]
</pre>
</div>
</div>
</div>

<div id="outline-container-org9972ad9" class="outline-3">
<h3 id="org9972ad9"><span class="section-number-3">3.3.</span> Numerical integration grid (grid group)</h3>
<div class="outline-text-3" id="text-3-3">
<p>
In some applications, such as DFT calculations, integrals have to
be computed numerically on a grid.  A common choice for the angular
grid is the one proposed by Lebedev and Laikov
[Russian Academy of Sciences Doklady Mathematics, Volume 59, Number 3, 1999, pages 477-481].
For the radial grids, many approaches have been developed over the years.
</p>

<p>
The structure of this group is adapted for the <a href="https://github.com/dftlibs/numgrid">numgrid</a> library.
Feel free to submit a PR if you find missing options/functionalities.
</p>

<table id="org31e869b" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>description</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Details about the used quadratures can go here</td>
</tr>

<tr>
<td class="org-left"><code>rad_precision</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Radial precision parameter (not used in some schemes like Krack-Kster)</td>
</tr>

<tr>
<td class="org-left"><code>num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of grid points</td>
</tr>

<tr>
<td class="org-left"><code>max_ang_num</code></td>
<td class="org-left"><code>int</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Maximum number of angular grid points (for pruning)</td>
</tr>

<tr>
<td class="org-left"><code>min_ang_num</code></td>
<td class="org-left"><code>int</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Minimum number of angular grid points (for pruning)</td>
</tr>

<tr>
<td class="org-left"><code>coord</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[grid.num]</code></td>
<td class="org-left"><code>(grid.num)</code></td>
<td class="org-left">Discretized coordinate space</td>
</tr>

<tr>
<td class="org-left"><code>weight</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[grid.num]</code></td>
<td class="org-left"><code>(grid.num)</code></td>
<td class="org-left">Grid weights according to a given partitioning (e.g. Becke)</td>
</tr>

<tr>
<td class="org-left"><code>ang_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of angular integration points (if used)</td>
</tr>

<tr>
<td class="org-left"><code>ang_coord</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[grid.ang_num]</code></td>
<td class="org-left"><code>(grid.ang_num)</code></td>
<td class="org-left">Discretized angular space (if used)</td>
</tr>

<tr>
<td class="org-left"><code>ang_weight</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[grid.ang_num]</code></td>
<td class="org-left"><code>(grid.ang_num)</code></td>
<td class="org-left">Angular grid weights (if used)</td>
</tr>

<tr>
<td class="org-left"><code>rad_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of radial integration points (if used)</td>
</tr>

<tr>
<td class="org-left"><code>rad_coord</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[grid.rad_num]</code></td>
<td class="org-left"><code>(grid.rad_num)</code></td>
<td class="org-left">Discretized radial space (if used)</td>
</tr>

<tr>
<td class="org-left"><code>rad_weight</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[grid.rad_num]</code></td>
<td class="org-left"><code>(grid.rad_num)</code></td>
<td class="org-left">Radial grid weights  (if used)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
