trex.org
** Atomic orbitals (ao group)

   AOs are defined as

   \[
   \chi_i (\mathbf{r}) = \mathcal{N}_i'\, P_{\eta(i)}(\mathbf{r})\, R_{s(i)} (\mathbf{r})
   \]

   where $i$ is the atomic orbital index, $P$ refers to either
   polynomials in $x,y,z$
   \[
   P_{\eta(i)}(\mathbf{r}) \equiv x^{\eta(i)_x} y^{\eta(i)_y} z^{\eta(i)_z}
   \]
   or /regular/ solid harmonics
   \[
   P_{\eta(i)}(\mathbf{r}) \to S^{m_i}_{\ell}(\mathbf{r}) \equiv \sqrt{\frac{4\pi}{2\ell+1}}\; r^\ell
   Y^{m_i}_{\ell}(\theta,\varphi)
   \]
   (see [[https://en.wikipedia.org/wiki/Solid_harmonics][Wikipedia]]), and $s(i)$
   specifies the shell on which the AO is expanded.


   $\eta(i)$ denotes the chosen angular function.  The AOs can be
   expressed using real solid harmonics or polynomials in Cartesian
   coordinates.  In the case of real solid harmonics, the AOs are
   ordered as $0, +1, -1, +2, -2, \dots, + m, -m$).  In
   the case of polynomials, the canonical (or alphabetical) ordering is
   used,

   | $p$      | $p_x, p_y, p_z$                                  |
   | $d$      | $d_{xx}, d_{xy}, d_{xz}, d_{yy}, d_{yz}, d_{zz}$ |
   | $f$      | $f_{xxx}, f_{xxy}, f_{xxz}, f_{xyy}, f_{xyz}$,   |
   |          | $f_{xzz}, f_{yyy}, f_{yyz}, f_{yzz}, f_{zzz}$    |
   | $\vdots$ |                                                  |

   Note that for \(p\) orbitals in spherical coordinates, the ordering
   is $0,+1,-1$ which corresponds to $p_z, p_x, p_y$.

   $\mathcal{N}_i'$ is a normalization factor that allows for different
   normalization coefficients within a single shell, as in the GAMESS
   convention where each individual function is unit-normalized.
   Using GAMESS convention, the normalization factor of the shell
   $\mathcal{N}_d$ in the ~basis~ group is appropriate for instance
   for the $d_z^2$ function (i.e.
   $\mathcal{N}_{d}\equiv\mathcal{N}_{z^2}$) but not for the $d_{xy}$
   AO, so the correction factor $\mathcal{N}_i'$ for $d_{xy}$ in the
   ~ao~ groups is the ratio $\frac{\mathcal{N}_{xy}}{\mathcal{N}_{z^2}}$.


   #+NAME: ao
  | Variable        | Type    | Row-major Dimensions | Column-major Dimensions | Description                          |
  |-----------------+---------+----------------------+-------------------------+--------------------------------------|
  | ~cartesian~     | ~int~   |                      |                         | ~1~: true, ~0~: false                |
  | ~num~           | ~dim~   |                      |                         | Total number of atomic orbitals      |
  | ~shell~         | ~index~ | ~[ao.num]~           | ~(ao.num)~              | Basis set shell for each AO          |
  | ~normalization~ | ~float~ | ~[ao.num]~           | ~(ao.num)~              | Normalization factor $\mathcal{N}_i$ |

   #+CALL: json(data=ao, title="ao")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "ao": {
	       "cartesian" : [ "int"  , []           ]
	 ,           "num" : [ "dim"  , []           ]
	 ,         "shell" : [ "index", [ "ao.num" ] ]
	 , "normalization" : [ "float", [ "ao.num" ] ]
       } ,
   #+end_src

   #+RESULTS:

   :end:

