trex.html

<div id="outline-container-org689b05c" class="outline-2">
<h2 id="org689b05c"><span class="section-number-2">4.</span> Orbitals</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org077b12d" class="outline-3">
<h3 id="org077b12d"><span class="section-number-3">4.1.</span> Atomic orbitals (ao group)</h3>
<div class="outline-text-3" id="text-4-1">
<p>
AOs are defined as
</p>

<p>
\[
   \chi_i (\mathbf{r}) = \mathcal{N}_i'\, P_{\eta(i)}(\mathbf{r})\, R_{s(i)} (\mathbf{r})
   \]
</p>

<p>
where \(i\) is the atomic orbital index, \(P\) refers to either
polynomials in \(x,y,z\)
\[
   P_{\eta(i)}(\mathbf{r}) \equiv x^{\eta(i)_x} y^{\eta(i)_y} z^{\eta(i)_z}
   \]
or <i>regular</i> solid harmonics
\[
   P_{\eta(i)}(\mathbf{r}) \to S^{m_i}_{\ell}(\mathbf{r}) \equiv \sqrt{\frac{4\pi}{2\ell+1}}\; r^\ell
   Y^{m_i}_{\ell}(\theta,\varphi)
   \]
(see <a href="https://en.wikipedia.org/wiki/Solid_harmonics">Wikipedia</a>), and \(s(i)\)
specifies the shell on which the AO is expanded.
</p>


<p>
\(\eta(i)\) denotes the chosen angular function.  The AOs can be
expressed using real solid harmonics or polynomials in Cartesian
coordinates.  In the case of real solid harmonics, the AOs are
ordered as \(0, +1, -1, +2, -2, \dots, + m, -m\)).  In
the case of polynomials, the canonical (or alphabetical) ordering is
used,
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">\(p\)</td>
<td class="org-left">\(p_x, p_y, p_z\)</td>
</tr>

<tr>
<td class="org-left">\(d\)</td>
<td class="org-left">\(d_{xx}, d_{xy}, d_{xz}, d_{yy}, d_{yz}, d_{zz}\)</td>
</tr>

<tr>
<td class="org-left">\(f\)</td>
<td class="org-left">\(f_{xxx}, f_{xxy}, f_{xxz}, f_{xyy}, f_{xyz}\),</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(f_{xzz}, f_{yyy}, f_{yyz}, f_{yzz}, f_{zzz}\)</td>
</tr>

<tr>
<td class="org-left">\(\vdots\)</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Note that for \(p\) orbitals in spherical coordinates, the ordering
is \(0,+1,-1\) which corresponds to \(p_z, p_x, p_y\).
</p>

<p>
\(\mathcal{N}_i'\) is a normalization factor that allows for different
normalization coefficients within a single shell, as in the GAMESS
convention where each individual function is unit-normalized.
Using GAMESS convention, the normalization factor of the shell
\(\mathcal{N}_d\) in the <code>basis</code> group is appropriate for instance
for the \(d_z^2\) function (i.e.
\(\mathcal{N}_{d}\equiv\mathcal{N}_{z^2}\)) but not for the \(d_{xy}\)
AO, so the correction factor \(\mathcal{N}_i'\) for \(d_{xy}\) in the
<code>ao</code> groups is the ratio \(\frac{\mathcal{N}_{xy}}{\mathcal{N}_{z^2}}\).
</p>


<table id="org5cbf482" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>cartesian</code></td>
<td class="org-left"><code>int</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>1</code>: true, <code>0</code>: false</td>
</tr>

<tr>
<td class="org-left"><code>num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Total number of atomic orbitals</td>
</tr>

<tr>
<td class="org-left"><code>shell</code></td>
<td class="org-left"><code>index</code></td>
<td class="org-left"><code>[ao.num]</code></td>
<td class="org-left"><code>(ao.num)</code></td>
<td class="org-left">Basis set shell for each AO</td>
</tr>

<tr>
<td class="org-left"><code>normalization</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[ao.num]</code></td>
<td class="org-left"><code>(ao.num)</code></td>
<td class="org-left">Normalization factor \(\mathcal{N}_i\)</td>
</tr>
</tbody>
</table>
</div>
