trex.org
*** Two-electron integrals (~ao_2e_int~ group)
    :PROPERTIES:
    :CUSTOM_ID: ao_two_e
    :END:

    The two-electron integrals for a two-electron operator $\hat{O}$ are
    \[ \langle p q \vert \hat{O} \vert r s \rangle \] in physicists
    notation, where $p,q,r,s$ are indices over atomic orbitals.

    #   TODO: Physicist / Chemist functions
    #   Functions are provided to get the indices in physicists or chemists
    #   notation.

    - \[ \hat{W}_{\text{ee}} = \sum_{i=2}^{N_\text{elec}} \sum_{j=1}^{i-1} \frac{1}{\vert \mathbf{r}_i - \mathbf{r}_j \vert} \] : electron-electron repulsive potential operator.
    - \[ \hat{W}^{lr}_{\text{ee}} = \sum_{i=2}^{N_\text{elec}}
      \sum_{j=1}^{i-1} \frac{\text{erf}(\mu\, \vert \mathbf{r}_i -
      \mathbf{r}_j \vert)}{\vert \mathbf{r}_i - \mathbf{r}_j \vert} \] : electron-electron long range potential

    The Cholesky decomposition of the integrals can also be stored:

    \[
    \langle ij | kl \rangle = \sum_{\alpha} G_{ik\alpha} G_{jl\alpha}
    \]

    #+NAME: ao_2e_int
  | Variable              | Type           | Row-major Dimensions                              | Column-major Dimensions                           | Description                                   |
  |-----------------------+----------------+---------------------------------------------------+---------------------------------------------------+-----------------------------------------------|
  | ~eri~                 | ~float sparse~ | ~[ao.num, ao.num, ao.num, ao.num]~                | ~(ao.num, ao.num, ao.num, ao.num)~                | Electron repulsion integrals                  |
  | ~eri_lr~              | ~float sparse~ | ~[ao.num, ao.num, ao.num, ao.num]~                | ~(ao.num, ao.num, ao.num, ao.num)~                | Long-range electron repulsion integrals       |
  | ~eri_cholesky_num~    | ~dim~          |                                                   |                                                   | Number of Cholesky vectors for ERI            |
  | ~eri_cholesky~        | ~float sparse~ | ~[ao_2e_int.eri_cholesky_num, ao.num, ao.num]~    | ~(ao.num, ao.num, ao_2e_int.eri_cholesky_num)~    | Cholesky decomposition of the ERI             |
  | ~eri_lr_cholesky_num~ | ~dim~          |                                                   |                                                   | Number of Cholesky vectors for long range ERI |
  | ~eri_lr_cholesky~     | ~float sparse~ | ~[ao_2e_int.eri_lr_cholesky_num, ao.num, ao.num]~ | ~(ao.num, ao.num, ao_2e_int.eri_lr_cholesky_num)~ | Cholesky decomposition of the long range ERI  |

    #+CALL: json(data=ao_2e_int, title="ao_2e_int")

    #+RESULTS:
    :results:
    #+begin_src python :tangle trex.json
	"ao_2e_int": {
			    "eri" : [ "float sparse", [ "ao.num", "ao.num", "ao.num", "ao.num" ]              ]
	  ,              "eri_lr" : [ "float sparse", [ "ao.num", "ao.num", "ao.num", "ao.num" ]              ]
	  ,    "eri_cholesky_num" : [ "dim"         , []                                                      ]
	  ,        "eri_cholesky" : [ "float sparse", [ "ao_2e_int.eri_cholesky_num", "ao.num", "ao.num" ]    ]
	  , "eri_lr_cholesky_num" : [ "dim"         , []                                                      ]
	  ,     "eri_lr_cholesky" : [ "float sparse", [ "ao_2e_int.eri_lr_cholesky_num", "ao.num", "ao.num" ] ]
	} ,
    #+end_src

    #+RESULTS:

    :end:

** Molecular orbitals (mo group)

   #+NAME: mo
  | Variable         | Type    | Row-major Dimensions | Column-major Dimensions | Description                                                              |
  |------------------+---------+----------------------+-------------------------+--------------------------------------------------------------------------|
  | ~type~           | ~str~   |                      |                         | Free text to identify the set of MOs (HF, Natural, Local, CASSCF, /etc/) |
  | ~num~            | ~dim~   |                      |                         | Number of MOs                                                            |
  | ~coefficient~    | ~float~ | ~[mo.num, ao.num]~   | ~(ao.num, mo.num)~      | MO coefficients                                                          |
  | ~coefficient_im~ | ~float~ | ~[mo.num, ao.num]~   | ~(ao.num, mo.num)~      | MO coefficients (imaginary part)                                         |
  | ~class~          | ~str~   | ~[mo.num]~           | ~(mo.num)~              | Choose among: Core, Inactive, Active, Virtual, Deleted                   |
  | ~symmetry~       | ~str~   | ~[mo.num]~           | ~(mo.num)~              | Symmetry in the point group                                              |
  | ~occupation~     | ~float~ | ~[mo.num]~           | ~(mo.num)~              | Occupation number                                                        |
  | ~energy~         | ~float~ | ~[mo.num]~           | ~(mo.num)~              | For canonical MOs, corresponding eigenvalue                              |
  | ~spin~           | ~int~   | ~[mo.num]~           | ~(mo.num)~              | For UHF wave functions, 0 is $\alpha$ and 1 is $\beta$                   |
  | ~k_point~        | ~index~ | ~[mo.num]~           | ~(mo.num)~              | For periodic calculations, the $k$ point to which each MO belongs        |

   **Warning**: ~mo.num~ is the total number of MOs stored in the file.
   For periodic calculations, this group contains all the MOs
   belonging to all $k$ points so ~mo.num~ will be the sum of the
   numbers of MOs in each $k$ point. For UHF wave functions, ~mo.num~
   is the number of spin-orbitals, twice the number of spatial orbitals.

   #+CALL: json(data=mo, title="mo")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "mo": {
		     "type" : [ "str"  , []                     ]
	 ,            "num" : [ "dim"  , []                     ]
	 ,    "coefficient" : [ "float", [ "mo.num", "ao.num" ] ]
	 , "coefficient_im" : [ "float", [ "mo.num", "ao.num" ] ]
	 ,          "class" : [ "str"  , [ "mo.num" ]           ]
	 ,       "symmetry" : [ "str"  , [ "mo.num" ]           ]
	 ,     "occupation" : [ "float", [ "mo.num" ]           ]
	 ,         "energy" : [ "float", [ "mo.num" ]           ]
	 ,           "spin" : [ "int"  , [ "mo.num" ]           ]
	 ,        "k_point" : [ "index", [ "mo.num" ]           ]
       } ,
   #+end_src

   #+RESULTS:

   :end:


