trex.html

<div id="outline-container-ao_two_e" class="outline-4">
<h4 id="ao_two_e"><span class="section-number-4">4.1.2.</span> Two-electron integrals (<code>ao_2e_int</code> group)</h4>
<div class="outline-text-4" id="text-ao_two_e">
<p>
The two-electron integrals for a two-electron operator \(\hat{O}\) are
\[ \langle p q \vert \hat{O} \vert r s \rangle \] in physicists
notation, where \(p,q,r,s\) are indices over atomic orbitals.
</p>

<ul class="org-ul">
<li>\[ \hat{W}_{\text{ee}} = \sum_{i=2}^{N_\text{elec}} \sum_{j=1}^{i-1} \frac{1}{\vert \mathbf{r}_i - \mathbf{r}_j \vert} \] : electron-electron repulsive potential operator.</li>
<li>\[ \hat{W}^{lr}_{\text{ee}} = \sum_{i=2}^{N_\text{elec}}
      \sum_{j=1}^{i-1} \frac{\text{erf}(\mu\, \vert \mathbf{r}_i -
      \mathbf{r}_j \vert)}{\vert \mathbf{r}_i - \mathbf{r}_j \vert} \] : electron-electron long range potential</li>
</ul>

<p>
The Cholesky decomposition of the integrals can also be stored:
</p>

<p>
\[
    \langle ij | kl \rangle = \sum_{\alpha} G_{ik\alpha} G_{jl\alpha}
    \]
</p>

<table id="org7f8e914" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>eri</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[ao.num, ao.num, ao.num, ao.num]</code></td>
<td class="org-left"><code>(ao.num, ao.num, ao.num, ao.num)</code></td>
<td class="org-left">Electron repulsion integrals</td>
</tr>

<tr>
<td class="org-left"><code>eri_lr</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[ao.num, ao.num, ao.num, ao.num]</code></td>
<td class="org-left"><code>(ao.num, ao.num, ao.num, ao.num)</code></td>
<td class="org-left">Long-range electron repulsion integrals</td>
</tr>

<tr>
<td class="org-left"><code>eri_cholesky_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of Cholesky vectors for ERI</td>
</tr>

<tr>
<td class="org-left"><code>eri_cholesky</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[ao_2e_int.eri_cholesky_num, ao.num, ao.num]</code></td>
<td class="org-left"><code>(ao.num, ao.num, ao_2e_int.eri_cholesky_num)</code></td>
<td class="org-left">Cholesky decomposition of the ERI</td>
</tr>

<tr>
<td class="org-left"><code>eri_lr_cholesky_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of Cholesky vectors for long range ERI</td>
</tr>

<tr>
<td class="org-left"><code>eri_lr_cholesky</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[ao_2e_int.eri_lr_cholesky_num, ao.num, ao.num]</code></td>
<td class="org-left"><code>(ao.num, ao.num, ao_2e_int.eri_lr_cholesky_num)</code></td>
<td class="org-left">Cholesky decomposition of the long range ERI</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org605564e" class="outline-3">
<h3 id="org605564e"><span class="section-number-3">4.2.</span> Molecular orbitals (mo group)</h3>
<div class="outline-text-3" id="text-4-2">
<table id="org28fdbe0" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>type</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Free text to identify the set of MOs (HF, Natural, Local, CASSCF, <i>etc</i>)</td>
</tr>

<tr>
<td class="org-left"><code>num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of MOs</td>
</tr>

<tr>
<td class="org-left"><code>coefficient</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, ao.num]</code></td>
<td class="org-left"><code>(ao.num, mo.num)</code></td>
<td class="org-left">MO coefficients</td>
</tr>

<tr>
<td class="org-left"><code>coefficient_im</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, ao.num]</code></td>
<td class="org-left"><code>(ao.num, mo.num)</code></td>
<td class="org-left">MO coefficients (imaginary part)</td>
</tr>

<tr>
<td class="org-left"><code>class</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left"><code>[mo.num]</code></td>
<td class="org-left"><code>(mo.num)</code></td>
<td class="org-left">Choose among: Core, Inactive, Active, Virtual, Deleted</td>
</tr>

<tr>
<td class="org-left"><code>symmetry</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left"><code>[mo.num]</code></td>
<td class="org-left"><code>(mo.num)</code></td>
<td class="org-left">Symmetry in the point group</td>
</tr>

<tr>
<td class="org-left"><code>occupation</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num]</code></td>
<td class="org-left"><code>(mo.num)</code></td>
<td class="org-left">Occupation number</td>
</tr>

<tr>
<td class="org-left"><code>energy</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num]</code></td>
<td class="org-left"><code>(mo.num)</code></td>
<td class="org-left">For canonical MOs, corresponding eigenvalue</td>
</tr>

<tr>
<td class="org-left"><code>spin</code></td>
<td class="org-left"><code>int</code></td>
<td class="org-left"><code>[mo.num]</code></td>
<td class="org-left"><code>(mo.num)</code></td>
<td class="org-left">For UHF wave functions, 0 is \(\alpha\) and 1 is \(\beta\)</td>
</tr>

<tr>
<td class="org-left"><code>k_point</code></td>
<td class="org-left"><code>index</code></td>
<td class="org-left"><code>[mo.num]</code></td>
<td class="org-left"><code>(mo.num)</code></td>
<td class="org-left">For periodic calculations, the \(k\) point to which each MO belongs</td>
</tr>
</tbody>
</table>

<p>
<b><b>Warning</b></b>: <code>mo.num</code> is the total number of MOs stored in the file.
For periodic calculations, this group contains all the MOs
belonging to all \(k\) points so <code>mo.num</code> will be the sum of the
numbers of MOs in each \(k\) point. For UHF wave functions, <code>mo.num</code>
is the number of spin-orbitals, twice the number of spatial orbitals.
</p>
</div>
