trex.org
*** One-electron integrals (~mo_1e_int~ group)

    The operators as the same as those defined in the
    [[#ao_one_e][AO one-electron integrals section]]. Here, the integrals are given in
    the basis of molecular orbitals.

    #+NAME: mo_1e_int
  | Variable              | Type    | Row-major Dimensions | Column-major Dimensions | Description                                                              |
  |-----------------------+---------+----------------------+-------------------------+--------------------------------------------------------------------------|
  | ~overlap~             | ~float~ | ~[mo.num, mo.num]~   | ~(mo.num, mo.num)~      | $\langle i \vert j \rangle$                                              |
  | ~kinetic~             | ~float~ | ~[mo.num, mo.num]~   | ~(mo.num, mo.num)~      | $\langle i \vert \hat{T}_e \vert j \rangle$                              |
  | ~potential_n_e~       | ~float~ | ~[mo.num, mo.num]~   | ~(mo.num, mo.num)~      | $\langle i \vert \hat{V}_{\text{ne}} \vert j \rangle$                    |
  | ~ecp~                 | ~float~ | ~[mo.num, mo.num]~   | ~(mo.num, mo.num)~      | $\langle i \vert \hat{V}_{\text{ECP}} \vert j \rangle$                   |
  | ~core_hamiltonian~    | ~float~ | ~[mo.num, mo.num]~   | ~(mo.num, mo.num)~      | $\langle i \vert \hat{h} \vert j \rangle$                                |
  | ~overlap_im~          | ~float~ | ~[mo.num, mo.num]~   | ~(mo.num, mo.num)~      | $\langle i \vert j \rangle$ (imaginary part)                             |
  | ~kinetic_im~          | ~float~ | ~[mo.num, mo.num]~   | ~(mo.num, mo.num)~      | $\langle i \vert \hat{T}_e \vert j \rangle$   (imaginary part)           |
  | ~potential_n_e_im~    | ~float~ | ~[mo.num, mo.num]~   | ~(mo.num, mo.num)~      | $\langle i \vert \hat{V}_{\text{ne}} \vert j \rangle$  (imaginary part)  |
  | ~ecp_im~              | ~float~ | ~[mo.num, mo.num]~   | ~(mo.num, mo.num)~      | $\langle i \vert \hat{V}_{\text{ECP}} \vert j \rangle$  (imaginary part) |
  | ~core_hamiltonian_im~ | ~float~ | ~[mo.num, mo.num]~   | ~(mo.num, mo.num)~      | $\langle i \vert \hat{h} \vert j \rangle$ (imaginary part)               |

    #+CALL: json(data=mo_1e_int, title="mo_1e_int")

    #+RESULTS:
    :results:
    #+begin_src python :tangle trex.json
	"mo_1e_int": {
			"overlap" : [ "float", [ "mo.num", "mo.num" ] ]
	  ,             "kinetic" : [ "float", [ "mo.num", "mo.num" ] ]
	  ,       "potential_n_e" : [ "float", [ "mo.num", "mo.num" ] ]
	  ,                 "ecp" : [ "float", [ "mo.num", "mo.num" ] ]
	  ,    "core_hamiltonian" : [ "float", [ "mo.num", "mo.num" ] ]
	  ,          "overlap_im" : [ "float", [ "mo.num", "mo.num" ] ]
	  ,          "kinetic_im" : [ "float", [ "mo.num", "mo.num" ] ]
	  ,    "potential_n_e_im" : [ "float", [ "mo.num", "mo.num" ] ]
	  ,              "ecp_im" : [ "float", [ "mo.num", "mo.num" ] ]
	  , "core_hamiltonian_im" : [ "float", [ "mo.num", "mo.num" ] ]
	} ,
    #+end_src

    #+RESULTS:

    :end:

*** Two-electron integrals (~mo_2e_int~ group)

    The operators are the same as those defined in the
    [[#ao_two_e][AO two-electron integrals section]]. Here, the integrals are given in
    the basis of molecular orbitals.

    #+NAME: mo_2e_int
  | Variable              | Type           | Row-major Dimensions                              | Column-major Dimensions                           | Description                                   |
  |-----------------------+----------------+---------------------------------------------------+---------------------------------------------------+-----------------------------------------------|
  | ~eri~                 | ~float sparse~ | ~[mo.num, mo.num, mo.num, mo.num]~                | ~(mo.num, mo.num, mo.num, mo.num)~                | Electron repulsion integrals                  |
  | ~eri_lr~              | ~float sparse~ | ~[mo.num, mo.num, mo.num, mo.num]~                | ~(mo.num, mo.num, mo.num, mo.num)~                | Long-range electron repulsion integrals       |
  | ~eri_cholesky_num~    | ~dim~          |                                                   |                                                   | Number of Cholesky vectors for ERI            |
  | ~eri_cholesky~        | ~float sparse~ | ~[mo_2e_int.eri_cholesky_num, mo.num, mo.num]~    | ~(mo.num, mo.num, mo_2e_int.eri_cholesky_num)~    | Cholesky decomposition of the ERI             |
  | ~eri_lr_cholesky_num~ | ~dim~          |                                                   |                                                   | Number of Cholesky vectors for long range ERI |
  | ~eri_lr_cholesky~     | ~float sparse~ | ~[mo_2e_int.eri_lr_cholesky_num, mo.num, mo.num]~ | ~(mo.num, mo.num, mo_2e_int.eri_lr_cholesky_num)~ | Cholesky decomposition of the long range ERI  |

    #+CALL: json(data=mo_2e_int, title="mo_2e_int")

    #+RESULTS:
    :results:
    #+begin_src python :tangle trex.json
	"mo_2e_int": {
			    "eri" : [ "float sparse", [ "mo.num", "mo.num", "mo.num", "mo.num" ]              ]
	  ,              "eri_lr" : [ "float sparse", [ "mo.num", "mo.num", "mo.num", "mo.num" ]              ]
	  ,    "eri_cholesky_num" : [ "dim"         , []                                                      ]
	  ,        "eri_cholesky" : [ "float sparse", [ "mo_2e_int.eri_cholesky_num", "mo.num", "mo.num" ]    ]
	  , "eri_lr_cholesky_num" : [ "dim"         , []                                                      ]
	  ,     "eri_lr_cholesky" : [ "float sparse", [ "mo_2e_int.eri_lr_cholesky_num", "mo.num", "mo.num" ] ]
	} ,
    #+end_src

    #+RESULTS:

    :end:

* Multi-determinant information
