trex.html


<div id="outline-container-org52a6dd2" class="outline-4">
<h4 id="org52a6dd2"><span class="section-number-4">4.2.1.</span> One-electron integrals (<code>mo_1e_int</code> group)</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
The operators as the same as those defined in the
<a href="#ao_one_e">AO one-electron integrals section</a>. Here, the integrals are given in
the basis of molecular orbitals.
</p>

<table id="orge207c2e" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>overlap</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert j \rangle\)</td>
</tr>

<tr>
<td class="org-left"><code>kinetic</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{T}_e \vert j \rangle\)</td>
</tr>

<tr>
<td class="org-left"><code>potential_n_e</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{V}_{\text{ne}} \vert j \rangle\)</td>
</tr>

<tr>
<td class="org-left"><code>ecp</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{V}_{\text{ECP}} \vert j \rangle\)</td>
</tr>

<tr>
<td class="org-left"><code>core_hamiltonian</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{h} \vert j \rangle\)</td>
</tr>

<tr>
<td class="org-left"><code>dipole_x</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{\mu}_x \vert j \rangle\)</td>
</tr>

<tr>
<td class="org-left"><code>dipole_y</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{\mu}_y \vert j \rangle\)</td>
</tr>

<tr>
<td class="org-left"><code>dipole_z</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{\mu}_z \vert j \rangle\)</td>
</tr>

<tr>
<td class="org-left"><code>overlap_im</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert j \rangle\) (imaginary part)</td>
</tr>

<tr>
<td class="org-left"><code>kinetic_im</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{T}_e \vert j \rangle\)   (imaginary part)</td>
</tr>

<tr>
<td class="org-left"><code>potential_n_e_im</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{V}_{\text{ne}} \vert j \rangle\)  (imaginary part)</td>
</tr>

<tr>
<td class="org-left"><code>ecp_im</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{V}_{\text{ECP}} \vert j \rangle\)  (imaginary part)</td>
</tr>

<tr>
<td class="org-left"><code>core_hamiltonian_im</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{h} \vert j \rangle\) (imaginary part)</td>
</tr>

<tr>
<td class="org-left"><code>dipole_x_im</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{\mu}_x \vert j \rangle\) (imaginary part)</td>
</tr>

<tr>
<td class="org-left"><code>dipole_y_im</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{\mu}_y \vert j \rangle\) (imaginary part)</td>
</tr>

<tr>
<td class="org-left"><code>dipole_z_im</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">\(\langle i \vert \hat{\mu}_z \vert j \rangle\) (imaginary part)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org93aee0f" class="outline-4">
<h4 id="org93aee0f"><span class="section-number-4">4.2.2.</span> Two-electron integrals (<code>mo_2e_int</code> group)</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
The operators are the same as those defined in the
<a href="#ao_two_e">AO two-electron integrals section</a>. Here, the integrals are given in
the basis of molecular orbitals.
</p>

<table id="org173f9e2" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>eri</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num, mo.num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, mo.num, mo.num)</code></td>
<td class="org-left">Electron repulsion integrals</td>
</tr>

<tr>
<td class="org-left"><code>eri_lr</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num, mo.num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, mo.num, mo.num)</code></td>
<td class="org-left">Long-range electron repulsion integrals</td>
</tr>

<tr>
<td class="org-left"><code>eri_cholesky_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of Cholesky vectors for ERI</td>
</tr>

<tr>
<td class="org-left"><code>eri_cholesky</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo_2e_int.eri_cholesky_num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, mo_2e_int.eri_cholesky_num)</code></td>
<td class="org-left">Cholesky decomposition of the ERI</td>
</tr>

<tr>
<td class="org-left"><code>eri_lr_cholesky_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of Cholesky vectors for long range ERI</td>
</tr>

<tr>
<td class="org-left"><code>eri_lr_cholesky</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo_2e_int.eri_lr_cholesky_num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, mo_2e_int.eri_lr_cholesky_num)</code></td>
<td class="org-left">Cholesky decomposition of the long range ERI</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-org21a9df2" class="outline-2">
<h2 id="org21a9df2"><span class="section-number-2">5.</span> Multi-determinant information</h2>
<div class="outline-text-2" id="text-5">
</div>
