trex.org
** Slater determinants (determinant group)

   The configuration interaction (CI) wave function $\Psi$
   can be expanded in the basis of Slater determinants $D_I$ as follows

   \[
   \Psi = \sum_I C_I D_I
   \]

   For relatively small expansions, a given determinant can be represented as a list of occupied orbitals.
   However, this becomes unfeasible for larger expansions and requires more advanced data structures.
   The bit field representation is used here, namely a given determinant is represented as $N_{\text{int}}$
   64-bit integers where j-th bit is set to 1 if there is an electron in the j-th orbital and 0 otherwise.
   This gives access to larger determinant expansions by optimising the storage of the determinant lists
   in the memory.

   \[
   D_I = \alpha_1 \alpha_2 \ldots \alpha_{n_\uparrow} \beta_1 \beta_2 \ldots \beta_{n_\downarrow}
   \]

   where $\alpha$ and $\beta$ denote \uparrow-spin and \downarrow-spin electrons, respectively,
   $n_\uparrow$ and $n_\downarrow$ correspond to ~electron.up_num~ and ~electron.dn_num~, respectively.

   The ordering of determinants in TREXIO files is $\alpha \alpha \ldots \alpha_{n_\uparrow} \beta \beta \ldots \beta_{n_\downarrow}$.
   The functions ~trexio_phase_aabb_to_abab~ and ~trexio_phase_aabb_to_abab_list~ help switching to the 
   $\alpha \beta \alpha \beta \ldots$ ordering by checking if a change of phase is required. These functions return ~TREXIO_SUCCESS~ if
   a change of phase is not required, or ~TREXIO_PHASE_CHANGE~ otherwise.

   Note: the ~special~ attribute is present in the types, meaning that the source node is not
   produced by the code generator.

   An illustration on how to read determinants is presented in the [[./examples.html][examples]].

   *Important*: The number of determinants is not explicitly written
   by the user (~dim_readonly~). It is automatically set by the number
   of determinants written in the determinant list.

   #+NAME: determinant
  | Variable      | Type             | Row-major Dimensions | Column-major Dimensions | Description                                            |
  |---------------+------------------+----------------------+-------------------------+--------------------------------------------------------|
  | ~num~         | ~dim readonly~   |                      |                         | Number of determinants                                 |
  | ~list~        | ~int special~    | ~[determinant.num]~  | ~(determinant.num)~     | List of determinants as integer bit fields             |
  | ~coefficient~ | ~float buffered~ | ~[determinant.num]~  | ~(determinant.num)~     | Coefficients of the determinants from the CI expansion |

   #+CALL: json(data=determinant, title="determinant")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "determinant": {
		   "num" : [ "dim readonly"  , []                    ]
	 ,        "list" : [ "int special"   , [ "determinant.num" ] ]
	 , "coefficient" : [ "float buffered", [ "determinant.num" ] ]
       } ,
   #+end_src

   #+RESULTS:

   :end:

** Configuration state functions (csf group)

   The configuration interaction (CI) wave function $\Psi$ can be
   expanded in the basis of [[https://en.wikipedia.org/wiki/Configuration_state_function][configuration state functions]] (CSFs)
   $\Psi_I$ as follows

   \[
   \Psi = \sum_I C_I \psi_I.
   \]

   Each CSF $\psi_I$ is a linear combination of Slater determinants. Slater
   determinants are stored in the =determinant= section. In this group
   we store the CI coefficients in the basis of CSFs, and the
   matrix $\langle D_I | \psi_J \rangle$ needed to project the CSFs in
   the basis of Slater determinants.

   *Important*: As opposed to the determinants, the number of CSFs
   (~csf.num~) has to be written by the user.

   #+NAME: csf
  | Variable          | Type             | Row-major Dimensions         | Column-major Dimensions      | Description                             |
  |-------------------+------------------+------------------------------+------------------------------+-----------------------------------------|
  | ~num~             | ~dim~            |                              |                              | Number of CSFs                          |
  | ~coefficient~     | ~float buffered~ | ~[csf.num]~                  | ~(csf.num)~                  | Coefficients $C_I$ of the CSF expansion |
  | ~det_coefficient~ | ~float sparse~   | ~[csf.num, determinant.num]~ | ~(determinant.num, csf.num)~ | Projection on the determinant basis     |

   #+CALL: json(data=csf, title="csf")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "csf": {
		       "num" : [ "dim"           , []                               ]
	 ,     "coefficient" : [ "float buffered", [ "csf.num" ]                    ]
	 , "det_coefficient" : [ "float sparse"  , [ "csf.num", "determinant.num" ] ]
       } ,
   #+end_src

   #+RESULTS:

   :end:

