trex.html
<div id="outline-container-orgab0a4bd" class="outline-3">
<h3 id="orgab0a4bd"><span class="section-number-3">5.1.</span> Slater determinants (determinant group)</h3>
<div class="outline-text-3" id="text-5-1">
<p>
The configuration interaction (CI) wave function \(\Psi\)
can be expanded in the basis of Slater determinants \(D_I\) as follows
</p>

<p>
\[
   \Psi = \sum_I C_I D_I
   \]
</p>

<p>
For relatively small expansions, a given determinant can be represented as a list of occupied orbitals.
However, this becomes unfeasible for larger expansions and requires more advanced data structures.
The bit field representation is used here, namely a given determinant is represented as \(N_{\text{int}}\)
64-bit integers where j-th bit is set to 1 if there is an electron in the j-th orbital and 0 otherwise.
This gives access to larger determinant expansions by optimising the storage of the determinant lists
in the memory.
</p>

<p>
\[
   D_I = \alpha_1 \alpha_2 \ldots \alpha_{n_\uparrow} \beta_1 \beta_2 \ldots \beta_{n_\downarrow}
   \]
</p>

<p>
where \(\alpha\) and \(\beta\) denote &uarr;-spin and &darr;-spin electrons, respectively,
\(n_\uparrow\) and \(n_\downarrow\) correspond to <code>electron.up_num</code> and <code>electron.dn_num</code>, respectively.
</p>

<p>
The ordering of determinants in TREXIO files is \(\alpha \alpha \ldots \alpha_{n_\uparrow} \beta \beta \ldots \beta_{n_\downarrow}\).
The functions <code>trexio_phase_aabb_to_abab</code> and <code>trexio_phase_aabb_to_abab_list</code> help switching to the 
\(\alpha \beta \alpha \beta \ldots\) ordering by checking if a change of phase is required. These functions return <code>TREXIO_SUCCESS</code> if
a change of phase is not required, or <code>TREXIO_PHASE_CHANGE</code> otherwise.
</p>

<p>
Note: the <code>special</code> attribute is present in the types, meaning that the source node is not
produced by the code generator.
</p>

<p>
An illustration on how to read determinants is presented in the <a href="./examples.html">examples</a>.
</p>

<p>
<b>Important</b>: The number of determinants is not explicitly written
by the user (<code>dim_readonly</code>). It is automatically set by the number
of determinants written in the determinant list.
</p>

<table id="org1f758d4" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>num</code></td>
<td class="org-left"><code>dim readonly</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of determinants</td>
</tr>

<tr>
<td class="org-left"><code>list</code></td>
<td class="org-left"><code>int special</code></td>
<td class="org-left"><code>[determinant.num]</code></td>
<td class="org-left"><code>(determinant.num)</code></td>
<td class="org-left">List of determinants as integer bit fields</td>
</tr>

<tr>
<td class="org-left"><code>coefficient</code></td>
<td class="org-left"><code>float buffered</code></td>
<td class="org-left"><code>[determinant.num]</code></td>
<td class="org-left"><code>(determinant.num)</code></td>
<td class="org-left">Coefficients of the determinants from the CI expansion</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgaed4105" class="outline-3">
<h3 id="orgaed4105"><span class="section-number-3">5.2.</span> Configuration state functions (csf group)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The configuration interaction (CI) wave function \(\Psi\) can be
expanded in the basis of <a href="https://en.wikipedia.org/wiki/Configuration_state_function">configuration state functions</a> (CSFs)
\(\Psi_I\) as follows
</p>

<p>
\[
   \Psi = \sum_I C_I \psi_I.
   \]
</p>

<p>
Each CSF \(\psi_I\) is a linear combination of Slater determinants. Slater
determinants are stored in the <code>determinant</code> section. In this group
we store the CI coefficients in the basis of CSFs, and the
matrix \(\langle D_I | \psi_J \rangle\) needed to project the CSFs in
the basis of Slater determinants.
</p>

<p>
<b>Important</b>: As opposed to the determinants, the number of CSFs
(<code>csf.num</code>) has to be written by the user.
</p>

<table id="orgf6b2f8f" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of CSFs</td>
</tr>

<tr>
<td class="org-left"><code>coefficient</code></td>
<td class="org-left"><code>float buffered</code></td>
<td class="org-left"><code>[csf.num]</code></td>
<td class="org-left"><code>(csf.num)</code></td>
<td class="org-left">Coefficients \(C_I\) of the CSF expansion</td>
</tr>

<tr>
<td class="org-left"><code>det_coefficient</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[csf.num, determinant.num]</code></td>
<td class="org-left"><code>(determinant.num, csf.num)</code></td>
<td class="org-left">Projection on the determinant basis</td>
</tr>
</tbody>
</table>
</div>
</div>
