trex.html

<div id="outline-container-orgbf377ef" class="outline-3">
<h3 id="orgbf377ef"><span class="section-number-3">5.3.</span> Amplitudes (amplitude group)</h3>
<div class="outline-text-3" id="text-5-3">
<p>
The wave function may be expressed in terms of action of the cluster
operator \(\hat{T}\):
</p>

<p>
\[
   \hat{T} = \hat{T}_1 + \hat{T}_2 + \hat{T}_3 + \dots
   \]
</p>

<p>
on a reference wave function \(\Psi\), where \(\hat{T}_1\) is the single excitation operator,
</p>

<p>
\[
   \hat{T}_1 = \sum_{ia} t_{i}^{a}\, \hat{a}^\dagger_a \hat{a}_i,
   \]
</p>

<p>
\(\hat{T}_2\) is the double excitation operator,
</p>

<p>
\[
   \hat{T}_2 = \frac{1}{4} \sum_{ijab} t_{ij}^{ab}\, \hat{a}^\dagger_a \hat{a}^\dagger_b \hat{a}_j \hat{a}_i,
   \]
</p>

<p>
<i>etc</i>. Indices \(i\), \(j\), \(a\) and \(b\) denote molecular orbital indices.
</p>

<p>
Wave functions obtained with perturbation theory or configuration
interaction are of the form
</p>

<p>
\[ |\Phi\rangle = \hat{T}|\Psi\rangle  \]
</p>

<p>
and coupled-cluster wave functions are of the form
</p>

<p>
\[ |\Phi\rangle = e^{\hat{T}}| \Psi \rangle \]
</p>

<p>
The reference wave function is stored using the <code>determinant</code> and/or
<code>csf</code> groups, and the amplitudes are stored using the current group.
The attributes with the <code>exp</code> suffix correspond to exponentialized operators.
</p>

<p>
The order of the indices is chosen such that
</p>
<ul class="org-ul">
<li><code>t(i,a)</code> = \(t_{i}^{a}\).</li>
<li><code>t(i,j,a,b)</code> = \(t_{ij}^{ab}\),</li>
<li><code>t(i,j,k,a,b,c)</code> = \(t_{ijk}^{abc}\),</li>
<li><code>t(i,j,k,l,a,b,c,d)</code> = \(t_{ijkl}^{abcd}\),</li>
<li>\(\dots\)</li>
</ul>

<table id="org0c3e434" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>single</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num,mo.num]</code></td>
<td class="org-left"><code>(mo.num,mo.num)</code></td>
<td class="org-left">Single excitation amplitudes</td>
</tr>

<tr>
<td class="org-left"><code>single_exp</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num,mo.num]</code></td>
<td class="org-left"><code>(mo.num,mo.num)</code></td>
<td class="org-left">Exponentialized single excitation amplitudes</td>
</tr>

<tr>
<td class="org-left"><code>double</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num,mo.num,mo.num,mo.num]</code></td>
<td class="org-left"><code>(mo.num,mo.num,mo.num,mo.num)</code></td>
<td class="org-left">Double excitation amplitudes</td>
</tr>

<tr>
<td class="org-left"><code>double_exp</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num,mo.num,mo.num,mo.num]</code></td>
<td class="org-left"><code>(mo.num,mo.num,mo.num,mo.num)</code></td>
<td class="org-left">Exponentialized double excitation amplitudes</td>
</tr>

<tr>
<td class="org-left"><code>triple</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num,mo.num,mo.num,mo.num,mo.num,mo.num]</code></td>
<td class="org-left"><code>(mo.num,mo.num,mo.num,mo.num,mo.num,mo.num)</code></td>
<td class="org-left">Triple excitation amplitudes</td>
</tr>

<tr>
<td class="org-left"><code>triple_exp</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num,mo.num,mo.num,mo.num,mo.num,mo.num]</code></td>
<td class="org-left"><code>(mo.num,mo.num,mo.num,mo.num,mo.num,mo.num)</code></td>
<td class="org-left">Exponentialized triple excitation amplitudes</td>
</tr>

<tr>
<td class="org-left"><code>quadruple</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num,mo.num,mo.num,mo.num,mo.num,mo.num,mo.num,mo.num]</code></td>
<td class="org-left"><code>(mo.num,mo.num,mo.num,mo.num,mo.num,mo.num,mo.num,mo.num)</code></td>
<td class="org-left">Quadruple excitation amplitudes</td>
</tr>

<tr>
<td class="org-left"><code>quadruple_exp</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num,mo.num,mo.num,mo.num,mo.num,mo.num,mo.num,mo.num]</code></td>
<td class="org-left"><code>(mo.num,mo.num,mo.num,mo.num,mo.num,mo.num,mo.num,mo.num)</code></td>
<td class="org-left">Exponentialized quadruple excitation amplitudes</td>
</tr>
</tbody>
</table>
</div>
</div>
