trex.org
** Reduced density matrices (rdm group)

   The reduced density matrices are defined in the basis of molecular
   orbitals.

   The \uparrow-spin and \downarrow-spin components of the one-body
   density matrix are given by
   \begin{eqnarray*}
     \gamma_{ij}^{\uparrow}   &=& \langle \Psi | \hat{a}^{\dagger}_{j\alpha}\, \hat{a}_{i\alpha} | \Psi \rangle \\
     \gamma_{ij}^{\downarrow} &=& \langle \Psi | \hat{a}^{\dagger}_{j\beta} \, \hat{a}_{i\beta}  | \Psi \rangle
   \end{eqnarray*}
   and the spin-summed one-body density matrix is
   \[
   \gamma_{ij} = \gamma^{\uparrow}_{ij} + \gamma^{\downarrow}_{ij}
   \]

   The $\uparrow \uparrow$,  $\downarrow \downarrow$, $\uparrow \downarrow$ components of the two-body density matrix are given by
   \begin{eqnarray*}
     \Gamma_{ijkl}^{\uparrow \uparrow} &=&
        \langle \Psi | \hat{a}^{\dagger}_{k\alpha}\, \hat{a}^{\dagger}_{l\alpha} \hat{a}_{j\alpha}\, \hat{a}_{i\alpha} | \Psi \rangle \\
     \Gamma_{ijkl}^{\downarrow \downarrow} &=&
        \langle \Psi | \hat{a}^{\dagger}_{k\beta}\, \hat{a}^{\dagger}_{l\beta} \hat{a}_{j\beta}\, \hat{a}_{i\beta} | \Psi \rangle \\
     \Gamma_{ijkl}^{\uparrow \downarrow} &=&
        \langle \Psi | \hat{a}^{\dagger}_{k\alpha}\, \hat{a}^{\dagger}_{l\beta} \hat{a}_{j\beta}\, \hat{a}_{i\alpha} | \Psi \rangle
        + \langle \Psi | \hat{a}^{\dagger}_{l\alpha}\, \hat{a}^{\dagger}_{k\beta} \hat{a}_{i\beta}\, \hat{a}_{j\alpha} | \Psi \rangle \\
   \end{eqnarray*}
   and the spin-summed one-body density matrix is
   \[
   \Gamma_{ijkl} = \Gamma_{ijkl}^{\uparrow \uparrow} +
     \Gamma_{ijkl}^{\downarrow \downarrow} + \Gamma_{ijkl}^{\uparrow \downarrow}.
   \]

   The total energy can be computed as:
   \[
   E = E_{\text{NN}} + \sum_{ij} \gamma_{ij} \langle j|h|i \rangle +
       \frac{1}{2} \sum_{ijlk} \Gamma_{ijkl} \langle k l | i j \rangle
   \]


   To compress the storage, the Cholesky decomposition of the RDMs can
   be stored:

   \[
     \Gamma_{ijkl} = \sum_{\alpha} G_{ij\alpha} G_{kl\alpha}
   \]

   Warning: as opposed to electron repulsion integrals, the
   decomposition is made such that the Cholesky vectors are expanded
   in a two-electron basis
   $f_{ij}(\mathbf{r}_1,\mathbf{r}_2) = \phi_i(\mathbf{r}_1) \phi_j(\mathbf{r}_2)$,
   whereas in electron repulsion integrals each Cholesky vector is
   expressed in a basis of a one-electron function
   $g_{ik}(\mathbf{r}_1) = \phi_i(\mathbf{r}_1) \phi_k(\mathbf{r}_1)$.

   #+NAME: rdm
  | Variable               | Type           | Row-major Dimensions                                     | Column-major Dimensions                                  | Description                                                           |
  |------------------------+----------------+----------------------------------------------------------+----------------------------------------------------------+-----------------------------------------------------------------------|
  | ~1e~                   | ~float~        | ~[mo.num, mo.num]~                                       | ~(mo.num, mo.num)~                                       | One body density matrix                                               |
  | ~1e_up~                | ~float~        | ~[mo.num, mo.num]~                                       | ~(mo.num, mo.num)~                                       | \uparrow-spin component of the one body density matrix                |
  | ~1e_dn~                | ~float~        | ~[mo.num, mo.num]~                                       | ~(mo.num, mo.num)~                                       | \downarrow-spin component of the one body density matrix              |
  | ~1e_transition~        | ~float~        | ~[state.num, state.num, mo.num, mo.num]~                 | ~(mo.num, mo.num, state.num, state.num)~                 | One-particle transition density matrices                              |
  | ~2e~                   | ~float sparse~ | ~[mo.num, mo.num, mo.num, mo.num]~                       | ~(mo.num, mo.num, mo.num, mo.num)~                       | Two-body reduced density matrix (spin trace)                          |
  | ~2e_upup~              | ~float sparse~ | ~[mo.num, mo.num, mo.num, mo.num]~                       | ~(mo.num, mo.num, mo.num, mo.num)~                       | \uparrow\uparrow component of the two-body reduced density matrix     |
  | ~2e_dndn~              | ~float sparse~ | ~[mo.num, mo.num, mo.num, mo.num]~                       | ~(mo.num, mo.num, mo.num, mo.num)~                       | \downarrow\downarrow component of the two-body reduced density matrix |
  | ~2e_updn~              | ~float sparse~ | ~[mo.num, mo.num, mo.num, mo.num]~                       | ~(mo.num, mo.num, mo.num, mo.num)~                       | \uparrow\downarrow component of the two-body reduced density matrix   |
  | ~2e_transition~        | ~float sparse~ | ~[state.num, state.num, mo.num, mo.num, mo.num, mo.num]~ | ~(mo.num, mo.num, mo.num, mo.num, state.num, state.num)~ | Two-particle transition density matrices                              |
  | ~2e_cholesky_num~      | ~dim~          |                                                          |                                                          | Number of Cholesky vectors                                            |
  | ~2e_cholesky~          | ~float sparse~ | ~[rdm.2e_cholesky_num, mo.num, mo.num]~                  | ~(mo.num, mo.num, rdm.2e_cholesky_num)~                  | Cholesky decomposition of the two-body RDM (spin trace)               |
  | ~2e_upup_cholesky_num~ | ~dim~          |                                                          |                                                          | Number of Cholesky vectors                                            |
  | ~2e_upup_cholesky~     | ~float sparse~ | ~[rdm.2e_upup_cholesky_num, mo.num, mo.num]~             | ~(mo.num, mo.num, rdm.2e_upup_cholesky_num)~             | Cholesky decomposition of the two-body RDM (\uparrow\uparrow)         |
  | ~2e_dndn_cholesky_num~ | ~dim~          |                                                          |                                                          | Number of Cholesky vectors                                            |
  | ~2e_dndn_cholesky~     | ~float sparse~ | ~[rdm.2e_dndn_cholesky_num, mo.num, mo.num]~             | ~(mo.num, mo.num, rdm.2e_dndn_cholesky_num)~             | Cholesky decomposition of the two-body RDM (\downarrow\downarrow)     |
  | ~2e_updn_cholesky_num~ | ~dim~          |                                                          |                                                          | Number of Cholesky vectors                                            |
  | ~2e_updn_cholesky~     | ~float sparse~ | ~[rdm.2e_updn_cholesky_num, mo.num, mo.num]~             | ~(mo.num, mo.num, rdm.2e_updn_cholesky_num)~             | Cholesky decomposition of the two-body RDM (\uparrow\downarrow)       |

   #+CALL: json(data=rdm, title="rdm")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "rdm": {
			     "1e" : [ "float"       , [ "mo.num", "mo.num" ]                                               ]
	 ,                "1e_up" : [ "float"       , [ "mo.num", "mo.num" ]                                               ]
	 ,                "1e_dn" : [ "float"       , [ "mo.num", "mo.num" ]                                               ]
	 ,        "1e_transition" : [ "float"       , [ "state.num", "state.num", "mo.num", "mo.num" ]                     ]
	 ,                   "2e" : [ "float sparse", [ "mo.num", "mo.num", "mo.num", "mo.num" ]                           ]
	 ,              "2e_upup" : [ "float sparse", [ "mo.num", "mo.num", "mo.num", "mo.num" ]                           ]
	 ,              "2e_dndn" : [ "float sparse", [ "mo.num", "mo.num", "mo.num", "mo.num" ]                           ]
	 ,              "2e_updn" : [ "float sparse", [ "mo.num", "mo.num", "mo.num", "mo.num" ]                           ]
	 ,        "2e_transition" : [ "float sparse", [ "state.num", "state.num", "mo.num", "mo.num", "mo.num", "mo.num" ] ]
	 ,      "2e_cholesky_num" : [ "dim"         , []                                                                   ]
	 ,          "2e_cholesky" : [ "float sparse", [ "rdm.2e_cholesky_num", "mo.num", "mo.num" ]                        ]
	 , "2e_upup_cholesky_num" : [ "dim"         , []                                                                   ]
	 ,     "2e_upup_cholesky" : [ "float sparse", [ "rdm.2e_upup_cholesky_num", "mo.num", "mo.num" ]                   ]
	 , "2e_dndn_cholesky_num" : [ "dim"         , []                                                                   ]
	 ,     "2e_dndn_cholesky" : [ "float sparse", [ "rdm.2e_dndn_cholesky_num", "mo.num", "mo.num" ]                   ]
	 , "2e_updn_cholesky_num" : [ "dim"         , []                                                                   ]
	 ,     "2e_updn_cholesky" : [ "float sparse", [ "rdm.2e_updn_cholesky_num", "mo.num", "mo.num" ]                   ]
       } ,
   #+end_src

   #+RESULTS:

   :end:

