trex.html

<div id="outline-container-org089ccdc" class="outline-3">
<h3 id="org089ccdc"><span class="section-number-3">5.4.</span> Reduced density matrices (rdm group)</h3>
<div class="outline-text-3" id="text-5-4">
<p>
The reduced density matrices are defined in the basis of molecular
orbitals.
</p>

<p>
The &uarr;-spin and &darr;-spin components of the one-body
density matrix are given by
</p>
\begin{eqnarray*}
  \gamma_{ij}^{\uparrow}   &=& \langle \Psi | \hat{a}^{\dagger}_{j\alpha}\, \hat{a}_{i\alpha} | \Psi \rangle \\
  \gamma_{ij}^{\downarrow} &=& \langle \Psi | \hat{a}^{\dagger}_{j\beta} \, \hat{a}_{i\beta}  | \Psi \rangle
\end{eqnarray*}
<p>
and the spin-summed one-body density matrix is
\[
   \gamma_{ij} = \gamma^{\uparrow}_{ij} + \gamma^{\downarrow}_{ij}
   \]
</p>

<p>
The \(\uparrow \uparrow\),  \(\downarrow \downarrow\), \(\uparrow \downarrow\) components of the two-body density matrix are given by
</p>
\begin{eqnarray*}
  \Gamma_{ijkl}^{\uparrow \uparrow} &=&
     \langle \Psi | \hat{a}^{\dagger}_{k\alpha}\, \hat{a}^{\dagger}_{l\alpha} \hat{a}_{j\alpha}\, \hat{a}_{i\alpha} | \Psi \rangle \\
  \Gamma_{ijkl}^{\downarrow \downarrow} &=&
     \langle \Psi | \hat{a}^{\dagger}_{k\beta}\, \hat{a}^{\dagger}_{l\beta} \hat{a}_{j\beta}\, \hat{a}_{i\beta} | \Psi \rangle \\
  \Gamma_{ijkl}^{\uparrow \downarrow} &=&
     \langle \Psi | \hat{a}^{\dagger}_{k\alpha}\, \hat{a}^{\dagger}_{l\beta} \hat{a}_{j\beta}\, \hat{a}_{i\alpha} | \Psi \rangle
     + \langle \Psi | \hat{a}^{\dagger}_{l\alpha}\, \hat{a}^{\dagger}_{k\beta} \hat{a}_{i\beta}\, \hat{a}_{j\alpha} | \Psi \rangle \\
\end{eqnarray*}
<p>
and the spin-summed one-body density matrix is
\[
   \Gamma_{ijkl} = \Gamma_{ijkl}^{\uparrow \uparrow} +
     \Gamma_{ijkl}^{\downarrow \downarrow} + \Gamma_{ijkl}^{\uparrow \downarrow}.
   \]
</p>

<p>
The total energy can be computed as:
\[
   E = E_{\text{NN}} + \sum_{ij} \gamma_{ij} \langle j|h|i \rangle +
       \frac{1}{2} \sum_{ijlk} \Gamma_{ijkl} \langle k l | i j \rangle
   \]
</p>


<p>
To compress the storage, the Cholesky decomposition of the RDMs can
be stored:
</p>

<p>
\[
     \Gamma_{ijkl} = \sum_{\alpha} G_{ij\alpha} G_{kl\alpha}
   \]
</p>

<p>
Warning: as opposed to electron repulsion integrals, the
decomposition is made such that the Cholesky vectors are expanded
in a two-electron basis
\(f_{ij}(\mathbf{r}_1,\mathbf{r}_2) = \phi_i(\mathbf{r}_1) \phi_j(\mathbf{r}_2)\),
whereas in electron repulsion integrals each Cholesky vector is
expressed in a basis of a one-electron function
\(g_{ik}(\mathbf{r}_1) = \phi_i(\mathbf{r}_1) \phi_k(\mathbf{r}_1)\).
</p>

<table id="org44aa5ac" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>1e</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">One body density matrix</td>
</tr>

<tr>
<td class="org-left"><code>1e_up</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">&uarr;-spin component of the one body density matrix</td>
</tr>

<tr>
<td class="org-left"><code>1e_dn</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num)</code></td>
<td class="org-left">&darr;-spin component of the one body density matrix</td>
</tr>

<tr>
<td class="org-left"><code>1e_transition</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[state.num, state.num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, state.num, state.num)</code></td>
<td class="org-left">One-particle transition density matrices</td>
</tr>

<tr>
<td class="org-left"><code>2e</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num, mo.num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, mo.num, mo.num)</code></td>
<td class="org-left">Two-body reduced density matrix (spin trace)</td>
</tr>

<tr>
<td class="org-left"><code>2e_upup</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num, mo.num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, mo.num, mo.num)</code></td>
<td class="org-left">&uarr;&uarr; component of the two-body reduced density matrix</td>
</tr>

<tr>
<td class="org-left"><code>2e_dndn</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num, mo.num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, mo.num, mo.num)</code></td>
<td class="org-left">&darr;&darr; component of the two-body reduced density matrix</td>
</tr>

<tr>
<td class="org-left"><code>2e_updn</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[mo.num, mo.num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, mo.num, mo.num)</code></td>
<td class="org-left">&uarr;&darr; component of the two-body reduced density matrix</td>
</tr>

<tr>
<td class="org-left"><code>2e_transition</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[state.num, state.num, mo.num, mo.num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, mo.num, mo.num, state.num, state.num)</code></td>
<td class="org-left">Two-particle transition density matrices</td>
</tr>

<tr>
<td class="org-left"><code>2e_cholesky_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of Cholesky vectors</td>
</tr>

<tr>
<td class="org-left"><code>2e_cholesky</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[rdm.2e_cholesky_num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, rdm.2e_cholesky_num)</code></td>
<td class="org-left">Cholesky decomposition of the two-body RDM (spin trace)</td>
</tr>

<tr>
<td class="org-left"><code>2e_upup_cholesky_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of Cholesky vectors</td>
</tr>

<tr>
<td class="org-left"><code>2e_upup_cholesky</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[rdm.2e_upup_cholesky_num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, rdm.2e_upup_cholesky_num)</code></td>
<td class="org-left">Cholesky decomposition of the two-body RDM (&uarr;&uarr;)</td>
</tr>

<tr>
<td class="org-left"><code>2e_dndn_cholesky_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of Cholesky vectors</td>
</tr>

<tr>
<td class="org-left"><code>2e_dndn_cholesky</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[rdm.2e_dndn_cholesky_num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, rdm.2e_dndn_cholesky_num)</code></td>
<td class="org-left">Cholesky decomposition of the two-body RDM (&darr;&darr;)</td>
</tr>

<tr>
<td class="org-left"><code>2e_updn_cholesky_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of Cholesky vectors</td>
</tr>

<tr>
<td class="org-left"><code>2e_updn_cholesky</code></td>
<td class="org-left"><code>float sparse</code></td>
<td class="org-left"><code>[rdm.2e_updn_cholesky_num, mo.num, mo.num]</code></td>
<td class="org-left"><code>(mo.num, mo.num, rdm.2e_updn_cholesky_num)</code></td>
<td class="org-left">Cholesky decomposition of the two-body RDM (&uarr;&darr;)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
