trex.org
* Correlation factors
** Jastrow factor (jastrow group)

   The Jastrow factor is an $N$-electron function which multiplies the CI
   expansion: $\Psi = \Phi \times \exp(J)$,

   In the following, we use the notations $r_{ij} = |\mathbf{r}_i - \mathbf{r}_j|$ and
   $R_{i\alpha} = |\mathbf{r}_i - \mathbf{R}_\alpha|$, where indices
   $i$ and $j$ refer to electrons and $\alpha$ to nuclei.

   Parameters for multiple forms of Jastrow factors can be saved in
   TREXIO files, and are described in the following sections. These
   are identified by the ~type~ attribute. The type can be one of the
   following:
   - ~CHAMP~
   - ~Mu~

*** CHAMP

    The first form of Jastrow factor is the one used in
    the [[https://trex-coe.eu/trex-quantum-chemistry-codes/champ][CHAMP]] program:

   \[
   J(\mathbf{r},\mathbf{R}) = J_{\text{eN}}(\mathbf{r},\mathbf{R}) + J_{\text{ee}}(\mathbf{r}) + J_{\text{eeN}}(\mathbf{r},\mathbf{R})
   \]


   $J_{\text{eN}}$ contains electron-nucleus terms:

   \[
   J_{\text{eN}}(\mathbf{r},\mathbf{R}) = \sum_{i=1}^{N_\text{elec}} \sum_{\alpha=1}^{N_\text{nucl}}\left[
   \frac{a_{1,\alpha}\, f_\alpha(R_{i\alpha})}{1+a_{2,\alpha}\,
   f_\alpha(R_{i\alpha})} + \sum_{p=2}^{N_\text{ord}^a} a_{p+1,\alpha}\, [f_\alpha(R_{i\alpha})]^p - J_{\text{eN}}^\infty
   \right]
   \]

   $J_{\text{ee}}$ contains electron-electron terms:

   \[
   J_{\text{ee}}(\mathbf{r}) =
   \sum_{i=1}^{N_\text{elec}} \sum_{j=1}^{i-1}
   \left[
   \frac{\frac{1}{2}\big(1 + \delta^{\uparrow\downarrow}_{ij}\big)\,b_1\, f_{\text{ee}}(r_{ij})}{1+b_2\, f_{\text{ee}}(r_{ij})} +
   \sum_{p=2}^{N_\text{ord}^b} b_{p+1}\, [f_{\text{ee}}(r_{ij})]^p  - J_{\text{ee},ij}^\infty
   \right]
   \]

   $\delta^{\uparrow\downarrow}_{ij}$ is zero when the electrons $i$ and
   $j$ have the same spin, and one otherwise.

   $J_{\text{eeN}}$ contains electron-electron-Nucleus terms:

   \[
    J_{\text{eeN}}(\mathbf{r},\mathbf{R}) =
    \sum_{\alpha=1}^{N_{\text{nucl}}}
     \sum_{i=1}^{N_{\text{elec}}}
      \sum_{j=1}^{i-1}
       \sum_{p=2}^{N_{\text{ord}}}
        \sum_{k=0}^{p-1}
         \sum_{l=0}^{p-k-2\delta_{k,0}}
           c_{lkp\alpha} \left[ g_{\text{ee}}({r}_{ij}) \right]^k \nonumber \\
            \left[ \left[ g_\alpha({R}_{i\alpha}) \right]^l + \left[ g_\alpha({R}_{j\alpha}) \right]^l \right]
             \left[ g_\alpha({R}_{i\,\alpha}) \,
  g_\alpha({R}_{j\alpha}) \right]^{(p-k-l)/2}
   \]
   $c_{lkp\alpha}$ are non-zero only when $p-k-l$ is even.

   The terms $J_{\text{ee},ij}^\infty$ and $J_{\text{eN}}^\infty$ are shifts to ensure that
   $J_{\text{eN}}$ and $J_{\text{ee}}$ have an asymptotic value of zero:

   \[
   J_{\text{eN}}^{\infty} =
   \frac{a_{1,\alpha}\, \kappa_\alpha^{-1}}{1+a_{2,\alpha}\,
   \kappa_\alpha^{-1}} + \sum_{p=2}^{N_\text{ord}^a} a_{p+1,\alpha}\, \kappa_\alpha^{-p}
   \]
   \[
   J_{\text{ee},ij}^{\infty} =
   \frac{\frac{1}{2}\big(1 + \delta^{\uparrow\downarrow}_{ij}\big)\,b_1\,
   \kappa_{\text{ee}}^{-1}}{1+b_2\, \kappa_{\text{ee}}^{-1}} +
   \sum_{p=2}^{N_\text{ord}^b} b_{p+1}\, \kappa_{\text{ee}}^{-p}
   \]

   $f$ and $g$ are scaling function defined as

   \[
   f_\alpha(r) = \frac{1-e^{-\kappa_\alpha\, r}}{\kappa_\alpha} \text{ and }
   g_\alpha(r) = e^{-\kappa_\alpha\, r},
   \]


*** Mu

   [[https://aip.scitation.org/doi/10.1063/5.0044683][Mu-Jastrow]] is based on a one-parameter correlation factor that has
   been introduced in the context of transcorrelated methods.  This
   correlation factor imposes the electron-electron cusp, and it is
   built such that the leading order in $1/r_{12}$ of the effective
   two-electron potential reproduces the long-range interaction of the
   range-separated density functional theory. Its analytical
   expression reads

   \[
   J(\mathbf{r}, \mathbf{R}) = J_{\text{eeN}}(\mathbf{r}, \mathbf{R}) +
                               J_{\text{eN}}(\mathbf{r}, \mathbf{R})
   \].

   The electron-electron cusp is incorporated in the three-body term

   \[
   J_\text{eeN} (\mathbf{r}, \mathbf{R}) =
   \sum_{i=1}^{N_\text{elec}} \sum_{j=1}^{i-1} \, u\left(\mu, r_{ij}\right) \,
   \Pi_{\alpha=1}^{N_{\text{nucl}}} \, E_\alpha({R}_{i\alpha}) \, E_\alpha({R}_{j\alpha}),
   \]

   where ww$u$ is an electron-electron function

   \[
   u\left(\mu, r\right) = \frac{r}{2} \, \left[ 1 - \text{erf}(\mu\, r) \right] - \frac{1}{2 \, \mu \, \sqrt{\pi}} \exp \left[ -(\mu \, r)^2 \right].
   \]

   This electron-electron term is tuned by the parameter $\mu$ which
   controls the depth and the range of the Coulomb hole between
   electrons.

   An envelope function has been introduced to cancel out the Jastrow
   effects between two-electrons when at least one is close to a nucleus
   (to perform a frozen-core calculation). The envelope function is
   given by

   \[
   E_\alpha(R) = 1 - \exp\left( - \gamma_{\alpha} \, R^2 \right).
   \]

   In particular, if the parameters $\gamma_\alpha$ tend to zero, the
   Mu-Jastrow factor becomes a two-body Jastrow factor:

   \[
   J_{\text{ee}}(\mathbf{r}) =
   \sum_{i=1}^{N_\text{elec}} \sum_{j=1}^{i-1} \, u\left(\mu, r_{ij}\right)
   \]

   and for large $\gamma_\alpha$ it becomes zero.

   To increase the flexibility of the Jastrow and improve the
   electron density the following electron-nucleus term is added

   \[
   J_{\text{eN}}(\mathbf{r},\mathbf{R}) = \sum_{i=1}^{N_\text{elec}} \sum_{\alpha=1}^{N_\text{nucl}} \,
   \left[ \exp\left( a_{\alpha} R_{i \alpha}^2 \right) - 1\right].
   \]


   The parameter $\mu$ is stored in the ~ee~ array, the parameters
   $\gamma_\alpha$ are stored in the ~een~ array, and the parameters
   $a_\alpha$ are stored in the ~en~ array.

