trex.html

<div id="outline-container-org86f211e" class="outline-2">
<h2 id="org86f211e"><span class="section-number-2">6.</span> Correlation factors</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org46f3db4" class="outline-3">
<h3 id="org46f3db4"><span class="section-number-3">6.1.</span> Jastrow factor (jastrow group)</h3>
<div class="outline-text-3" id="text-6-1">
<p>
The Jastrow factor is an $N$-electron function which multiplies the CI
expansion: \(\Psi = \Phi \times \exp(J)\),
</p>

<p>
In the following, we use the notations \(r_{ij} = |\mathbf{r}_i - \mathbf{r}_j|\) and
\(R_{i\alpha} = |\mathbf{r}_i - \mathbf{R}_\alpha|\), where indices
\(i\) and \(j\) refer to electrons and \(\alpha\) to nuclei.
</p>

<p>
Parameters for multiple forms of Jastrow factors can be saved in
TREXIO files, and are described in the following sections. These
are identified by the <code>type</code> attribute. The type can be one of the
following:
</p>
<ul class="org-ul">
<li><code>CHAMP</code></li>
<li><code>Mu</code></li>
</ul>
</div>

<div id="outline-container-org328a185" class="outline-4">
<h4 id="org328a185"><span class="section-number-4">6.1.1.</span> CHAMP</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
The first form of Jastrow factor is the one used in
the <a href="https://trex-coe.eu/trex-quantum-chemistry-codes/champ">CHAMP</a> program:
</p>

<p>
\[
   J(\mathbf{r},\mathbf{R}) = J_{\text{eN}}(\mathbf{r},\mathbf{R}) + J_{\text{ee}}(\mathbf{r}) + J_{\text{eeN}}(\mathbf{r},\mathbf{R})
   \]
</p>


<p>
\(J_{\text{eN}}\) contains electron-nucleus terms:
</p>

<p>
\[
   J_{\text{eN}}(\mathbf{r},\mathbf{R}) = \sum_{i=1}^{N_\text{elec}} \sum_{\alpha=1}^{N_\text{nucl}}\left[
   \frac{a_{1,\alpha}\, f_\alpha(R_{i\alpha})}{1+a_{2,\alpha}\,
   f_\alpha(R_{i\alpha})} + \sum_{p=2}^{N_\text{ord}^a} a_{p+1,\alpha}\, [f_\alpha(R_{i\alpha})]^p - J_{\text{eN}}^\infty
   \right]
   \]
</p>

<p>
\(J_{\text{ee}}\) contains electron-electron terms:
</p>

<p>
\[
   J_{\text{ee}}(\mathbf{r}) =
   \sum_{i=1}^{N_\text{elec}} \sum_{j=1}^{i-1}
   \left[
   \frac{\frac{1}{2}\big(1 + \delta^{\uparrow\downarrow}_{ij}\big)\,b_1\, f_{\text{ee}}(r_{ij})}{1+b_2\, f_{\text{ee}}(r_{ij})} +
   \sum_{p=2}^{N_\text{ord}^b} b_{p+1}\, [f_{\text{ee}}(r_{ij})]^p  - J_{\text{ee},ij}^\infty
   \right]
   \]
</p>

<p>
\(\delta^{\uparrow\downarrow}_{ij}\) is zero when the electrons \(i\) and
\(j\) have the same spin, and one otherwise.
</p>

<p>
\(J_{\text{eeN}}\) contains electron-electron-Nucleus terms:
</p>

<p>
\[
    J_{\text{eeN}}(\mathbf{r},\mathbf{R}) =
    \sum_{\alpha=1}^{N_{\text{nucl}}}
     \sum_{i=1}^{N_{\text{elec}}}
      \sum_{j=1}^{i-1}
       \sum_{p=2}^{N_{\text{ord}}}
        \sum_{k=0}^{p-1}
         \sum_{l=0}^{p-k-2\delta_{k,0}}
           c_{lkp\alpha} \left[ g_{\text{ee}}({r}_{ij}) \right]^k \nonumber \\
            \left[ \left[ g_\alpha({R}_{i\alpha}) \right]^l + \left[ g_\alpha({R}_{j\alpha}) \right]^l \right]
             \left[ g_\alpha({R}_{i\,\alpha}) \,
  g_\alpha({R}_{j\alpha}) \right]^{(p-k-l)/2}
   \]
\(c_{lkp\alpha}\) are non-zero only when \(p-k-l\) is even.
</p>

<p>
The terms \(J_{\text{ee},ij}^\infty\) and \(J_{\text{eN}}^\infty\) are shifts to ensure that
\(J_{\text{eN}}\) and \(J_{\text{ee}}\) have an asymptotic value of zero:
</p>

<p>
\[
   J_{\text{eN}}^{\infty} =
   \frac{a_{1,\alpha}\, \kappa_\alpha^{-1}}{1+a_{2,\alpha}\,
   \kappa_\alpha^{-1}} + \sum_{p=2}^{N_\text{ord}^a} a_{p+1,\alpha}\, \kappa_\alpha^{-p}
   \]
\[
   J_{\text{ee},ij}^{\infty} =
   \frac{\frac{1}{2}\big(1 + \delta^{\uparrow\downarrow}_{ij}\big)\,b_1\,
   \kappa_{\text{ee}}^{-1}}{1+b_2\, \kappa_{\text{ee}}^{-1}} +
   \sum_{p=2}^{N_\text{ord}^b} b_{p+1}\, \kappa_{\text{ee}}^{-p}
   \]
</p>

<p>
\(f\) and \(g\) are scaling function defined as
</p>

<p>
\[
   f_\alpha(r) = \frac{1-e^{-\kappa_\alpha\, r}}{\kappa_\alpha} \text{ and }
   g_\alpha(r) = e^{-\kappa_\alpha\, r},
   \]
</p>
</div>
</div>


<div id="outline-container-org8a5ced6" class="outline-4">
<h4 id="org8a5ced6"><span class="section-number-4">6.1.2.</span> Mu</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
<a href="https://aip.scitation.org/doi/10.1063/5.0044683">Mu-Jastrow</a> is based on a one-parameter correlation factor that has
been introduced in the context of transcorrelated methods.  This
correlation factor imposes the electron-electron cusp, and it is
built such that the leading order in \(1/r_{12}\) of the effective
two-electron potential reproduces the long-range interaction of the
range-separated density functional theory. Its analytical
expression reads
</p>

<p>
\[
   J(\mathbf{r}, \mathbf{R}) = J_{\text{eeN}}(\mathbf{r}, \mathbf{R}) +
                               J_{\text{eN}}(\mathbf{r}, \mathbf{R})
   \].
</p>

<p>
The electron-electron cusp is incorporated in the three-body term
</p>

<p>
\[
   J_\text{eeN} (\mathbf{r}, \mathbf{R}) =
   \sum_{i=1}^{N_\text{elec}} \sum_{j=1}^{i-1} \, u\left(\mu, r_{ij}\right) \,
   \Pi_{\alpha=1}^{N_{\text{nucl}}} \, E_\alpha({R}_{i\alpha}) \, E_\alpha({R}_{j\alpha}),
   \]
</p>

<p>
where ww\(u\) is an electron-electron function
</p>

<p>
\[
   u\left(\mu, r\right) = \frac{r}{2} \, \left[ 1 - \text{erf}(\mu\, r) \right] - \frac{1}{2 \, \mu \, \sqrt{\pi}} \exp \left[ -(\mu \, r)^2 \right].
   \]
</p>

<p>
This electron-electron term is tuned by the parameter \(\mu\) which
controls the depth and the range of the Coulomb hole between
electrons.
</p>

<p>
An envelope function has been introduced to cancel out the Jastrow
effects between two-electrons when at least one is close to a nucleus
(to perform a frozen-core calculation). The envelope function is
given by
</p>

<p>
\[
   E_\alpha(R) = 1 - \exp\left( - \gamma_{\alpha} \, R^2 \right).
   \]
</p>

<p>
In particular, if the parameters \(\gamma_\alpha\) tend to zero, the
Mu-Jastrow factor becomes a two-body Jastrow factor:
</p>

<p>
\[
   J_{\text{ee}}(\mathbf{r}) =
   \sum_{i=1}^{N_\text{elec}} \sum_{j=1}^{i-1} \, u\left(\mu, r_{ij}\right)
   \]
</p>

<p>
and for large \(\gamma_\alpha\) it becomes zero.
</p>

<p>
To increase the flexibility of the Jastrow and improve the
electron density the following electron-nucleus term is added
</p>

<p>
\[
   J_{\text{eN}}(\mathbf{r},\mathbf{R}) = \sum_{i=1}^{N_\text{elec}} \sum_{\alpha=1}^{N_\text{nucl}} \,
   \left[ \exp\left( a_{\alpha} R_{i \alpha}^2 \right) - 1\right].
   \]
</p>


<p>
The parameter \(\mu\) is stored in the <code>ee</code> array, the parameters
\(\gamma_\alpha\) are stored in the <code>een</code> array, and the parameters
\(a_\alpha\) are stored in the <code>en</code> array.
</p>
</div>
</div>
