trex.org
*** Table of values

   #+name: jastrow
  | Variable      | Type    | Row-major Dimensions | Column-major Dimensions | Description                                                     |
  |---------------+---------+----------------------+-------------------------+-----------------------------------------------------------------|
  | ~type~        | ~str~   |                      |                         | Type of Jastrow factor: ~CHAMP~ or ~Mu~                         |
  | ~en_num~      | ~dim~   |                      |                         | Number of Electron-nucleus parameters                           |
  | ~ee_num~      | ~dim~   |                      |                         | Number of Electron-electron parameters                          |
  | ~een_num~     | ~dim~   |                      |                         | Number of Electron-electron-nucleus parameters                  |
  | ~en~          | ~float~ | ~[jastrow.en_num]~   | ~(jastrow.en_num)~      | Electron-nucleus parameters                                     |
  | ~ee~          | ~float~ | ~[jastrow.ee_num]~   | ~(jastrow.ee_num)~      | Electron-electron parameters                                    |
  | ~een~         | ~float~ | ~[jastrow.een_num]~  | ~(jastrow.een_num)~     | Electron-electron-nucleus parameters                            |
  | ~en_nucleus~  | ~index~ | ~[jastrow.en_num]~   | ~(jastrow.en_num)~      | Nucleus relative to the eN parameter                            |
  | ~een_nucleus~ | ~index~ | ~[jastrow.een_num]~  | ~(jastrow.een_num)~     | Nucleus relative to the eeN parameter                           |
  | ~ee_scaling~  | ~float~ |                      |                         | $\kappa$ value in CHAMP Jastrow for electron-electron distances |
  | ~en_scaling~  | ~float~ | ~[nucleus.num]~      | ~(nucleus.num)~         | $\kappa$ value in CHAMP Jastrow for electron-nucleus distances  |

   #+CALL: json(data=jastrow, title="jastrow")

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "jastrow": {
		  "type" : [ "str"  , []                    ]
	 ,      "en_num" : [ "dim"  , []                    ]
	 ,      "ee_num" : [ "dim"  , []                    ]
	 ,     "een_num" : [ "dim"  , []                    ]
	 ,          "en" : [ "float", [ "jastrow.en_num" ]  ]
	 ,          "ee" : [ "float", [ "jastrow.ee_num" ]  ]
	 ,         "een" : [ "float", [ "jastrow.een_num" ] ]
	 ,  "en_nucleus" : [ "index", [ "jastrow.en_num" ]  ]
	 , "een_nucleus" : [ "index", [ "jastrow.een_num" ] ]
	 ,  "ee_scaling" : [ "float", []                    ]
	 ,  "en_scaling" : [ "float", [ "nucleus.num" ]     ]
       } ,
   #+end_src

   #+RESULTS:

   :end:

* Quantum Monte Carlo data (qmc group)

   In quantum Monte Carlo calculations, the wave function is evaluated
   at points of the 3N-dimensional space. Some algorithms require multiple
   independent /walkers/, so it is possible to store multiple coordinates,
   as well as some quantities evaluated at those points.

   By convention, the electron coordinates contain first all the electrons
   of $\uparrow$-spin and then all the $\downarrow$-spin.

   #+name: qmc
  | Variable | Type    | Row-major Dimensions         | Column-major Dimensions      | Description                           |
  |----------+---------+------------------------------+------------------------------+---------------------------------------|
  | ~num~    | ~dim~   |                              |                              | Number of 3N-dimensional points       |
  | ~point~  | ~float~ | ~[qmc.num, electron.num, 3]~ | ~(3, electron.num, qmc.num)~ | 3N-dimensional points                 |
  | ~psi~    | ~float~ | ~[qmc.num]~                  | ~(qmc.num)~                  | Wave function evaluated at the points |
  | ~e_loc~  | ~float~ | ~[qmc.num]~                  | ~(qmc.num)~                  | Local energy evaluated at the points  |

   #+CALL: json(data=qmc, title="qmc", last=1)

   #+RESULTS:
   :results:
   #+begin_src python :tangle trex.json
       "qmc": {
	     "num" : [ "dim"  , []                                 ]
	 , "point" : [ "float", [ "qmc.num", "electron.num", "3" ] ]
	 ,   "psi" : [ "float", [ "qmc.num" ]                      ]
	 , "e_loc" : [ "float", [ "qmc.num" ]                      ]
       }
   #+end_src

   #+RESULTS:

   :end:

* Appendix    :noexport:
** Python script from table to json

 #+NAME: json
 #+begin_src python :var data=nucleus title="End" last=0 :results output drawer
print("""#+begin_src python :tangle trex.json""")
if title != "End":
    print("""    "%s": {"""%(title))
    indent = "        "
    f1 = 0 ; f2 = 0 ; f3 = 0
    for line in data:
        line = [ x.replace("~","") for x in line ]
        name = '"'+line[0]+'"'
        typ  = '"'+line[1]+'"'
        dims = line[2]
        if '[' in dims:
            dims = dims.strip()[1:-1]
            dims = [ '"'+x.strip()+'"' for x in dims.split(',') ]
            dims = "[ " + ", ".join(dims) + " ]"
        else:
            dims = "[ ]"
        f1 = max(f1, len(name))
        f2 = max(f2, len(typ))
        f3 = max(f3, len(dims))

    fmt = "%%s%%%ds : [ %%%ds, %%%ds ]" % (f1, f2, f3)
    for line in data:
        line = [ x.replace("~","") for x in line ]
        name = '"'+line[0]+'"'
        typ  = '"'+line[1]+'"'
        dims = line[2]
        if '[' in dims:
            dims = dims.strip()[1:-1]
            dims = [ '"'+x.strip()+'"' for x in dims.split(',') ]
            dims = "[ " + ", ".join(dims) + " ]"
        else:
            if dims.strip() != "":
                dims = "ERROR"
            else:
                dims = "[]"
        buffer = fmt % (indent, name, typ.ljust(f2), dims.ljust(f3))
        indent = "      , "
        print(buffer)

    if last == 0:
        print("    } ,")
    else:
        print("    }")
else:
    print("}")

print("""#+end_src""")
 #+end_src

 #+RESULTS: json
 :results:
 #+begin_src python :tangle trex.json
 }
 #+end_src

 #+RESULTS:

 :end:
