trex.html

<div id="outline-container-orgcddc2dc" class="outline-4">
<h4 id="orgcddc2dc"><span class="section-number-4">6.1.3.</span> Table of values</h4>
<div class="outline-text-4" id="text-6-1-3">
<table id="orgc12d588" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>type</code></td>
<td class="org-left"><code>str</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Type of Jastrow factor: <code>CHAMP</code> or <code>Mu</code></td>
</tr>

<tr>
<td class="org-left"><code>en_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of Electron-nucleus parameters</td>
</tr>

<tr>
<td class="org-left"><code>ee_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of Electron-electron parameters</td>
</tr>

<tr>
<td class="org-left"><code>een_num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of Electron-electron-nucleus parameters</td>
</tr>

<tr>
<td class="org-left"><code>en</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[jastrow.en_num]</code></td>
<td class="org-left"><code>(jastrow.en_num)</code></td>
<td class="org-left">Electron-nucleus parameters</td>
</tr>

<tr>
<td class="org-left"><code>ee</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[jastrow.ee_num]</code></td>
<td class="org-left"><code>(jastrow.ee_num)</code></td>
<td class="org-left">Electron-electron parameters</td>
</tr>

<tr>
<td class="org-left"><code>een</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[jastrow.een_num]</code></td>
<td class="org-left"><code>(jastrow.een_num)</code></td>
<td class="org-left">Electron-electron-nucleus parameters</td>
</tr>

<tr>
<td class="org-left"><code>en_nucleus</code></td>
<td class="org-left"><code>index</code></td>
<td class="org-left"><code>[jastrow.en_num]</code></td>
<td class="org-left"><code>(jastrow.en_num)</code></td>
<td class="org-left">Nucleus relative to the eN parameter</td>
</tr>

<tr>
<td class="org-left"><code>een_nucleus</code></td>
<td class="org-left"><code>index</code></td>
<td class="org-left"><code>[jastrow.een_num]</code></td>
<td class="org-left"><code>(jastrow.een_num)</code></td>
<td class="org-left">Nucleus relative to the eeN parameter</td>
</tr>

<tr>
<td class="org-left"><code>ee_scaling</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(\kappa\) value in CHAMP Jastrow for electron-electron distances</td>
</tr>

<tr>
<td class="org-left"><code>en_scaling</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[nucleus.num]</code></td>
<td class="org-left"><code>(nucleus.num)</code></td>
<td class="org-left">\(\kappa\) value in CHAMP Jastrow for electron-nucleus distances</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-org23525d3" class="outline-2">
<h2 id="org23525d3"><span class="section-number-2">7.</span> Quantum Monte Carlo data (qmc group)</h2>
<div class="outline-text-2" id="text-7">
<p>
In quantum Monte Carlo calculations, the wave function is evaluated
at points of the 3N-dimensional space. Some algorithms require multiple
independent <i>walkers</i>, so it is possible to store multiple coordinates,
as well as some quantities evaluated at those points.
</p>

<p>
By convention, the electron coordinates contain first all the electrons
of $&uarr;$-spin and then all the $&darr;$-spin.
</p>

<table id="orgbac2cff" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Row-major Dimensions</th>
<th scope="col" class="org-left">Column-major Dimensions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>num</code></td>
<td class="org-left"><code>dim</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Number of 3N-dimensional points</td>
</tr>

<tr>
<td class="org-left"><code>point</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[qmc.num, electron.num, 3]</code></td>
<td class="org-left"><code>(3, electron.num, qmc.num)</code></td>
<td class="org-left">3N-dimensional points</td>
</tr>

<tr>
<td class="org-left"><code>psi</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[qmc.num]</code></td>
<td class="org-left"><code>(qmc.num)</code></td>
<td class="org-left">Wave function evaluated at the points</td>
</tr>

<tr>
<td class="org-left"><code>e_loc</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>[qmc.num]</code></td>
<td class="org-left"><code>(qmc.num)</code></td>
<td class="org-left">Local energy evaluated at the points</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TREX-CoE</p>
<p class="date">Created: 2025-08-02 Sat 10:55</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
